Emacs.org
#+title: Emacs  Configuration
#+PROPERTY: header-args:emacs-lisp :tangle programs/emacs/init.el :mkdirp yes
#+macro: revision-date (eval (format-time-string "%F %T %z"))
#+macro: count-words (eval (count-words (point-min) (point-max)))

*This file has {{{count-words}}} words and was last revised on {{{revision-date}}}.*

