Emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-20 Do 01:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs  Configuration</title>
<meta name="author" content="Leon Schwarzäugl" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs  Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h:a86fe971-f169-4052-aacf-15e0f267c6cd">1. Introduction (no code)</a></li>
<li><a href="#h:2c331451-45ed-4592-9e00-d36b5bf31248">2. Initialization (early-init.el)</a>
<ul>
<li><a href="#h:38e03b65-9dfc-4547-b27d-236664d7dc15">2.1. Increase startup performance</a></li>
<li><a href="#h:782b3632-afb2-4c67-8c46-ff94408aef5d">2.2. Setup frames</a></li>
<li><a href="#h:396c47f2-7e2f-4fad-ae71-6483bf7e3e42">2.3. Make C-i, C-m, C-[ available in graphic sessions</a></li>
</ul>
</li>
<li><a href="#h:601ba407-b906-4869-8ef6-67a9fc285fba">3. Personal settings</a>
<ul>
<li><a href="#h:b7b5976a-db2b-493d-8794-1924a0e12aec">3.1. Custom functions</a>
<ul>
<li><a href="#h:b715d7cf-da09-4e0c-95bc-8281b4f3ce9c">3.1.1. Emacs/Evil state toggle</a></li>
<li><a href="#h:1e0ee570-e509-4ecb-a3af-b75543731bb0">3.1.2. Switching to last used buffer</a></li>
<li><a href="#h:34506761-06b9-43b5-a818-506d9b3faf28">3.1.3. mu4e functions</a></li>
<li><a href="#h:4b9d74ef-0376-45bb-bc15-d24a04ca7e81">3.1.4. Create non-existant directories when finding file</a></li>
<li><a href="#h:91e2f45f-54fa-4b60-8758-b2ef9b439af7">3.1.5. [crux] Duplicate Lines</a></li>
<li><a href="#h:4819720a-9220-4c34-b903-ed4179f3ad1c">3.1.6. [prot] org-id-headings</a></li>
<li><a href="#h:285e5c0a-875d-46a8-bb9b-0222b3d73878">3.1.7. Inhibit Messages in Echo Area</a></li>
<li><a href="#h:de249f2a-6a2b-4114-8046-09d1014a7391">3.1.8. Move up one directory for find-file</a></li>
<li><a href="#h:06b77d28-3fd5-4554-8c7d-32c1b0ec8da5">3.1.9. org-mode: General setup</a></li>
<li><a href="#h:fa710375-2efe-49b4-af6a-a875aca6e4a2">3.1.10. org-mode: Visual-fill column</a></li>
<li><a href="#h:59d4306e-9b73-4b2c-b039-6a6518c357fc">3.1.11. org-mode: Auto-tangle and export Configuration Files</a></li>
<li><a href="#h:dfa66e78-5748-45e3-a975-db3da104bb3a">3.1.12. org-mode: Fold current heading</a></li>
<li><a href="#h:a1802f9b-bb71-4fd5-86fa-945da18e8b81">3.1.13. corfu: Do not interrupt navigation</a></li>
<li><a href="#org5fff398">3.1.14. python shell reloading</a></li>
</ul>
</li>
<li><a href="#h:2b827c27-0de7-45ed-9d9e-6c511e2c6bb5">3.2. Custom Keybindings</a></li>
<li><a href="#h:07951589-54ba-4e3e-bd7b-4106cd22ff6a">3.3. Directory setup</a></li>
<li><a href="#h:0cf30b76-91d9-41da-a10b-74199bc36d40">3.4. Unclutter .emacs.d</a></li>
<li><a href="#h:329f529a-ef9f-4787-b311-1c485e05b754">3.5. Move backup files to another location</a></li>
</ul>
</li>
<li><a href="#h:786b447d-03ad-4c1d-b114-c37caa2d591c">4. General init.el setup + UI</a>
<ul>
<li><a href="#h:76a5bd78-a20d-4068-bea8-a38fdb26428e">4.1. General setup</a></li>
<li><a href="#h:0debe8fd-b319-4ab7-a92c-784fa7896b75">4.2. Mark all themes as safe</a></li>
<li><a href="#h:b587e869-9911-443b-bc6d-8fb3ce31908d">4.3. Show less compilation warnings</a></li>
<li><a href="#h:6527b3ce-b76d-431a-9960-a57da7c53e1b">4.4. Indentation</a></li>
<li><a href="#h:3dc9fb1d-cd16-4bd0-a9ac-55a944415a90">4.5. Scrolling</a></li>
<li><a href="#h:5bf9f014-ee96-42da-b285-7b34f04e6bb1">4.6. Evil</a>
<ul>
<li><a href="#h:218376e8-086b-46bf-91b3-78295d5d440f">4.6.1. General evil</a></li>
<li><a href="#h:bde208f3-01ef-4dc6-9981-65f3d2a8189b">4.6.2. evil-collection</a></li>
<li><a href="#h:d80e3f7d-0185-4a15-832b-d756e576265c">4.6.3. evil-snipe</a></li>
<li><a href="#h:b06a378d-5248-4451-8eee-e65a3a768b1d">4.6.4. evil-cleverparens</a></li>
<li><a href="#h:aac82e5e-d882-4870-b644-ebdd0a2daae3">4.6.5. evil-surround</a></li>
</ul>
</li>
<li><a href="#h:e888d7a7-1755-4109-af11-5358b8cf140e">4.7. ispell</a></li>
<li><a href="#h:60f87342-0491-4c56-8057-6f075cf35753">4.8. Font Configuration</a></li>
<li><a href="#h:72a9704b-83d2-4b74-a1f6-d333203f62db">4.9. Theme</a></li>
<li><a href="#h:eb0ea526-a83a-4664-b3a1-2b40d3a31493">4.10. Icons</a></li>
<li><a href="#h:455ed7ac-ee7f-4f94-b857-f2c58b2282d0">4.11. Variable Pitch Mode</a></li>
<li><a href="#h:ed585848-875a-4673-910c-d2e1901dd95b">4.12. Modeline</a></li>
<li><a href="#h:39ae01e9-8053-4f76-aa77-8cbbbcff9652">4.13. Helper Modes</a>
<ul>
<li><a href="#h:b190d512-bfb5-42ec-adec-8d86bab726ce">4.13.1. Vertico, Orderless, Marginalia, Consult, Embark</a></li>
<li><a href="#h:cbf6bd48-2503-489a-89da-e3359564e989">4.13.2. Helpful + which-key: Better help defaults</a></li>
</ul>
</li>
<li><a href="#h:bbbd9cc8-3a84-4810-a3d5-b8536a5fbda1">4.14. Ligatures</a></li>
<li><a href="#h:e9d40e63-0e1f-47df-98f7-5427992588a4">4.15. Popup (popper) + Shackle Buffers</a></li>
<li><a href="#h:a6d23c8c-125f-4e36-af30-ff0a1e0d5a28">4.16. Indicate first and last line of buffer</a></li>
</ul>
</li>
<li><a href="#h:f2622fd3-7f14-47a8-8c21-33574fcbf14b">5. Modules</a>
<ul>
<li><a href="#h:99544398-72af-4382-b8e1-01b2221baff4">5.1. Org Mode</a>
<ul>
<li><a href="#h:877c9401-a354-4e44-a235-db1a90d19e00">5.1.1. General org-mode</a></li>
<li><a href="#h:2b3b4eb6-68a1-476d-b5d1-940a21484f1d">5.1.2. org-agenda</a></li>
<li><a href="#h:23183635-3d46-4d7d-8eda-e0a085b335ef">5.1.3. org capture templates</a></li>
<li><a href="#h:40528f5a-c8cd-471b-b862-4088e8e61860">5.1.4. Font Faces</a></li>
<li><a href="#h:62829574-a069-44b8-afb3-401a268d2747">5.1.5. org-appear</a></li>
<li><a href="#h:bbcfa895-4d46-4b1d-b84e-f634e982c46e">5.1.6. Centered org-mode Buffers</a></li>
<li><a href="#h:c1a0adea-ca97-43d7-b5a0-b856d2ebc9a8">5.1.7. Fix headings not folding sometimes</a></li>
<li><a href="#h:3e0b6da3-0497-4080-bb49-bab949c03bc4">5.1.8. Babel</a></li>
<li><a href="#h:4696e2fc-3296-47dc-8fc3-66912c329d4c">5.1.9. aucTex</a></li>
<li><a href="#h:406e5ecb-66f0-49bf-85ca-8b499f73ec5b">5.1.10. org-download</a></li>
<li><a href="#h:a02b1162-3e19-46f1-8efc-9f375971645c">5.1.11. org-fragtog</a></li>
<li><a href="#h:95b42e77-767c-4461-9ba8-b1c1cd18266c">5.1.12. org-modern</a></li>
<li><a href="#h:4e11a845-a7bb-4eb5-b4ce-5b2f52e07425">5.1.13. Presentations</a></li>
</ul>
</li>
<li><a href="#h:406c2ecc-0e3e-4d9f-9ae3-3eb1f8b87d1b">5.2. Nix Mode</a></li>
<li><a href="#h:50327461-a11b-4e81-830a-90febc720cfa">5.3. Markdown Mode</a>
<ul>
<li><a href="#h:734dc40a-a2c4-4839-b884-cb99b81aa6fe">5.3.1. Mode</a></li>
<li><a href="#h:8d90fe51-0b32-423a-a159-4f853bc29b68">5.3.2. LaTeX in Markdown</a></li>
</ul>
</li>
<li><a href="#h:65e69741-9860-4ed0-bbed-7b7be9a2a9d6">5.4. Olivetti</a></li>
<li><a href="#h:94d4a0dc-b0d7-4702-b760-beeaa6da2b8f">5.5. darkroom</a></li>
<li><a href="#h:87453f1c-8ea5-4d0a-862d-8973d5bc5405">5.6. Ripgrep</a></li>
<li><a href="#h:543641d0-02a9-459e-a2d6-96c8fcc06864">5.7. Tree-sitter</a></li>
<li><a href="#h:82ddeef2-99f8-465b-ba36-07c3eaad717b">5.8. direnv</a></li>
<li><a href="#h:efb3f0fd-e846-4df9-ba48-2e45d776f68f">5.9. avy</a></li>
<li><a href="#h:1c1821c6-98de-4079-a4f3-6ba6e6dcb668">5.10. crdt (Collaborative Editing)</a></li>
<li><a href="#h:d9a6cb44-736e-4608-951f-e928e1b757c0">5.11. devdocs</a></li>
<li><a href="#h:5cde5032-251e-4cc4-9202-b4ce996f92c2">5.12. Projectile</a></li>
<li><a href="#h:d2c7323d-f8c6-4f23-b70a-930e3e4ecce5">5.13. Magit</a></li>
<li><a href="#h:1a8585ed-d9f2-478f-a132-440ada1cde2c">5.14. Forge</a></li>
<li><a href="#h:cf5b0e6b-56a5-4a93-99fb-258eb7cb2eb4">5.15. git-timemachine</a></li>
<li><a href="#h:d9671ab7-a75a-47c6-a1f4-376d126c9b0a">5.16. Delimiters (brackets): rainbow-delimiters, highlight-parentheses</a></li>
<li><a href="#h:d1a32a69-2f9a-45ef-95fe-a00e3551dc94">5.17. rainbow-mode</a></li>
<li><a href="#h:5653d693-ecca-4c95-9633-66b9e3241070">5.18. Corfu</a></li>
<li><a href="#h:c3cc1c12-3ab8-42b7-be07-63f54eac397f">5.19. cape</a></li>
<li><a href="#h:3aa20438-edf6-4b13-a90d-3d5c51239c44">5.20. rust</a></li>
<li><a href="#h:b9b27a88-06f3-470b-a604-a20b2079bc26">5.21. Tramp</a></li>
<li><a href="#h:58415e95-8a7a-4517-acbb-5f1bb1028603">5.22. diff-hl</a></li>
<li><a href="#h:d60ce0b1-cabf-43f5-a236-a1e4b400d2f5">5.23. Commenting</a></li>
<li><a href="#h:9ec11ee4-2250-414a-87b5-73ee680a3a4a">5.24. yasnippet</a></li>
<li><a href="#org8a3df1c">5.25. eglot</a></li>
<li><a href="#org0d359ae">5.26. Breadcrumb</a></li>
<li><a href="#h:e9a30d0f-423f-4e85-af4b-f8560f1c1b53">5.27. Prevent breaking of hardlinks</a></li>
<li><a href="#h:0918557a-8463-430c-b8df-6546dea9abd0">5.28. Dirvish</a></li>
<li><a href="#h:b108dd3e-f34d-4ed3-98df-0bf9de055889">5.29. pdf-tools: pdf-viewer and support for dirvish</a></li>
<li><a href="#h:c15efae7-b884-4c97-8367-ccc7e7ed9ba8">5.30. Jupyter</a></li>
<li><a href="#h:1fc538d1-8c53-48b2-8652-66046f4bbbf8">5.31. undo-tree</a></li>
<li><a href="#h:b6c18dd0-3377-47ea-80c3-ac1486454e18">5.32. Hydra</a>
<ul>
<li><a href="#h:c5681884-7040-4b55-ab1b-5777631a0514">5.32.1. Text scaling</a></li>
</ul>
</li>
<li><a href="#h:fff816a0-6d70-4bda-abab-833345e51100">5.33. External Applications</a>
<ul>
<li><a href="#h:9335d32d-bf08-4601-820d-f3d1f33f876f">5.33.1. Obsidian</a></li>
<li><a href="#h:5854c9a6-1319-4961-a112-75b1bf2e1f69">5.33.2. Anki</a></li>
</ul>
</li>
<li><a href="#h:2f333330-b19d-4f64-85ea-146ff28667e8">5.34. Email + Calendar</a>
<ul>
<li><a href="#h:48fde614-7cd0-4764-a7ac-0dae60d8b65a">5.34.1. make sure mu4e is found</a></li>
<li><a href="#h:b92a18cf-eec3-4605-a8c2-37133ade3574">5.34.2. mu4e</a></li>
<li><a href="#h:43209eeb-5d46-472e-b7c2-58a3fb465199">5.34.3. mu4e-alert</a></li>
<li><a href="#h:c760f04e-622f-4b3e-8916-53ca8cce6edc">5.34.4. Calendar</a></li>
</ul>
</li>
<li><a href="#h:48f5be2b-b3d2-4276-bd49-2630733f23d5">5.35. Dashboard: emacs startup screen</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<b>This file has 16683 words and was last revised on 2024-06-20 01:55:44 +0200.</b>
</p>

<div id="outline-container-h:a86fe971-f169-4052-aacf-15e0f267c6cd" class="outline-2">
<h2 id="h:a86fe971-f169-4052-aacf-15e0f267c6cd"><span class="section-number-2">1.</span> Introduction (no code)</h2>
<div class="outline-text-2" id="text-h:a86fe971-f169-4052-aacf-15e0f267c6cd">
<p>
This is my Emacs literate configuration. It is part of a NixOS system that is fully declarative and can be found here:
</p>

<ul class="org-ul">
<li><a href="https:github.com/Swarsel/.dotfiles"><code>SwarselSystems</code> on github.com</a></li>
<li><a href="https:swagit.swarsel.win/Swarsel/.dotfiles"><code>SwarselSystems</code> on swagit.swarsel.win</a></li>
</ul>

<p>
The literate configuration lets me explain my choices to my future self as well as you, the reader. I go to great lengths to explain the choices for all configuration steps that I take in order for me to pay due diligence in crafting my setup, and not simply copying big chunks of other peoples code. Also, the literate configuration approach is very convenient to me as I only need to keep of (ideally) a single file to manage all of my configuration. I hope that this documentation will make it easier for beginners to get into Emacs and NixOS as I know it can be a struggle in the beginning.
</p>

<p>
Due to a NixOS specific setting, I currently manage two files (<code>Emacs.org</code> and <code>Nixos.org</code>), but I hope to soon find a way to consolidate them into a single file.
</p>

<p>
My emacs is built using the emacs-overlay nix flake, which builds a bleeding edge emacs on wayland (pgtk) with utilities like treesitter support. By executing the below source block, the current build setting can be updated at any time, and you can see my most up-to-date build options (last updated: 2024-06-20 01:55:44 +0200)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
system-configuration-options

</pre>
</div>

<pre class="example">
--prefix=/nix/store/lymgpfqr5dp1wc0khbcbhhjnxq8ccsy9-emacs-pgtk-20240521.0 --disable-build-details --with-modules --with-pgtk --with-compress-install --with-toolkit-scroll-bars --with-native-compilation --without-imagemagick --with-mailutils --without-small-ja-dic --with-tree-sitter --without-xinput2 --with-xwidgets --with-dbus --with-selinux
</pre>


<p>
This file is not loaded by Emacs directly as the configuration (even though this would be possible) - instead, it generates two more files:
</p>

<ul class="org-ul">
<li><code>early-init.el</code>
This file handle startup optimization and sets up the basic frame that I will be working in.</li>
<li><code>init.el</code>
This file handles the rest of the Emacs configuration.</li>
</ul>

<p>
By using the configuration offered by this file, the file you are reading right now (<code>Emacs.org</code>) will be freshly tangled on every file save. However, when you clone this configuration yourself and have not yet activated it, you need to tangle the file yourself. This can be done using the keybind <code>C-c C-v t</code>. Alternatively, execute the following block:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(org-babel-tangle)

</pre>
</div>

<p>
Lastly, you will notice there is no package system setup in this configuration. This is because packages are automatically handled on the NixOS side by parsing the <code>Emacs.org</code> file for package installs.
</p>
</div>
</div>
