Emacs.html
<div id="outline-container-h:2c331451-45ed-4592-9e00-d36b5bf31248" class="outline-2">
<h2 id="h:2c331451-45ed-4592-9e00-d36b5bf31248"><span class="section-number-2">2.</span> Initialization (early-init.el)</h2>
<div class="outline-text-2" id="text-h:2c331451-45ed-4592-9e00-d36b5bf31248">
<p>
In this section I handle my early init file; it takes care of frame-setup for emacsclient buffers.
</p>
</div>

<div id="outline-container-h:38e03b65-9dfc-4547-b27d-236664d7dc15" class="outline-3">
<h3 id="h:38e03b65-9dfc-4547-b27d-236664d7dc15"><span class="section-number-3">2.1.</span> Increase startup performance</h3>
<div class="outline-text-3" id="text-h:38e03b65-9dfc-4547-b27d-236664d7dc15">
<p>
First, I use some advice from doomemacs regarding garbace collection; here I make sure that during startup, the garbace collectur will not run, which will improve startup times. Now, that might not really be needed since I will usually only start the emacs server once during startup and then not touch it again, however, since I am building my emacs configuration using NixOS, there is some merit to this since I will usually need to restart the server once I rebuild my configuration.
</p>

<p>
Also, inspired by a setting I have seen in protesilaos' configuration, I apply the same idea to the <code>file-name-handler-alist</code> and <code>vc-handled-backends</code>.
</p>

<p>
In the end, we need to restore those values to values that will work during normal operation. For that, I add a hook to the startup function that will revert the values once Emacs has finished initialization.
</p>

<p>
Also packed into the hook function is the line <code>(fset 'epg-wait-for-status 'ignore)</code>. This line is needed at the end of the configuration in order to allow for my Yubikey to be used to encrypt and decrypt <code>.gpg</code> files. Without it, Emacs will just hang forever and basically crash.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defvar swarsel-file-name-handler-alist file-name-handler-alist)
(defvar swarsel-vc-handled-backends vc-handled-backends)

(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.6
      file-name-handler-alist nil
      vc-handled-backends nil)

(add-hook 'emacs-startup-hook
          (lambda ()
            (progn
              (setq gc-cons-threshold (* 1000 1000 8)
                    gc-cons-percentage 0.1
                    file-name-handler-alist swarsel-file-name-handler-alist
                    vc-handled-backends swarsel-vc-handled-backends)
              (fset 'epg-wait-for-status 'ignore)
              )))

</pre>
</div>
</div>
</div>
<div id="outline-container-h:782b3632-afb2-4c67-8c46-ff94408aef5d" class="outline-3">
<h3 id="h:782b3632-afb2-4c67-8c46-ff94408aef5d"><span class="section-number-3">2.2.</span> Setup frames</h3>
<div class="outline-text-3" id="text-h:782b3632-afb2-4c67-8c46-ff94408aef5d">
<p>
Next, I will setup the basic frame for my emacs buffers. Note that I use a tiling window manager, so I do not need to hold myself up with sizing the windows myself. I also disable some GUI tools that I (like many others) do not find to be particularly useful. Also I inhibit many startup functions here, even though it does not affect me greatly since I use another solution for that.
</p>

<p>
We also make require immediate compilation of native code.
</p>

<p>
For the <code>default-frame-alist</code>, I used to also set <code>'(right-divider-width . 4)</code> and <code>'(bottom-divider-width . 4)</code>, but I did not like the look of the divider bar and usually know my splits anyways, so this is no longer set.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(tool-bar-mode 0)
(menu-bar-mode 0)
(scroll-bar-mode 0)

(setq frame-inhibit-implied-resize t
      ring-bell-function 'ignore
      use-dialog-box nil
      use-file-dialog nil
      use-short-answers t
      inhibit-startup-message t
      inhibit-splash-screen t
      inhibit-startup-screen t
      inhibit-x-resources t
      inhibit-startup-buffer-menu t
      inhibit-startup-echo-area-message user-login-name ; this needs to be set to the username or it will not have an effect
      comp-deferred-compilation nil ; compile all Elisp to native code immediately
      )

(setq-default left-margin-width 1
              right-margin-width 1)

(setq-default default-frame-alist
      (append
       (list
        '(undecorated . t) ; no title bar, borders etc.
        '(background-color . "#1D252C") ; load doom-citylight colors to avoid white flash
        '(foreground-color . "#A0B3C5") ; load doom-citylight colors to avoid white flash
        '(vertical-scroll-bars . nil)
        '(horizontal-scroll-bars . nil)
        '(internal-border-width . 5)
        '(tool-bar-lines . 0)
        '(menu-bar-lines . 0))))

</pre>
</div>
</div>
</div>
<div id="outline-container-h:396c47f2-7e2f-4fad-ae71-6483bf7e3e42" class="outline-3">
<h3 id="h:396c47f2-7e2f-4fad-ae71-6483bf7e3e42"><span class="section-number-3">2.3.</span> Make C-i, C-m, C-[ available in graphic sessions</h3>
<div class="outline-text-3" id="text-h:396c47f2-7e2f-4fad-ae71-6483bf7e3e42">
<p>
By default, emacs binds
</p>
<ul class="org-ul">
<li><code>C-i</code> to the <code>TAB</code> key</li>
<li><code>C-m</code> to the <code>RET</code> key</li>
<li><code>C-[</code> to the <code>ECS</code> key</li>
</ul>

<p>
These keybinds exist to make Emacs work well in terminal mode. However, most of the time I am using Emacs in a graphic session, and I would hence like to have these keybinds available for personal use.
</p>

<p>
NOTE: To use these keybinds, you need to enclose the binding in angled brackets (<code>&lt;&gt;</code>). Then they can be used normally
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(add-hook
    'after-make-frame-functions
    (lambda (frame)
      (with-selected-frame frame
        (when (display-graphic-p)
          (define-key input-decode-map (kbd "C-i") [DUMMY-i])
          (define-key input-decode-map (kbd "C-[") [DUMMY-lsb])
          (define-key input-decode-map (kbd "C-m") [DUMMY-m])
          ))))




</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-h:601ba407-b906-4869-8ef6-67a9fc285fba" class="outline-2">
<h2 id="h:601ba407-b906-4869-8ef6-67a9fc285fba"><span class="section-number-2">3.</span> Personal settings</h2>
<div class="outline-text-2" id="text-h:601ba407-b906-4869-8ef6-67a9fc285fba">
<p>
This section is used to define my own functions, own variables, and own keybindings.
</p>
</div>

<div id="outline-container-h:b7b5976a-db2b-493d-8794-1924a0e12aec" class="outline-3">
<h3 id="h:b7b5976a-db2b-493d-8794-1924a0e12aec"><span class="section-number-3">3.1.</span> Custom functions</h3>
<div class="outline-text-3" id="text-h:b7b5976a-db2b-493d-8794-1924a0e12aec">
<p>
In this section I define extra functions that I need. Some of these functions I wrote myself, some I found after internet reseach. For functions I found on the internet, I will link the original source I found it in.
</p>
</div>

<div id="outline-container-h:b715d7cf-da09-4e0c-95bc-8281b4f3ce9c" class="outline-4">
<h4 id="h:b715d7cf-da09-4e0c-95bc-8281b4f3ce9c"><span class="section-number-4">3.1.1.</span> Emacs/Evil state toggle</h4>
<div class="outline-text-4" id="text-h:b715d7cf-da09-4e0c-95bc-8281b4f3ce9c">
<p>
Since I am rebinding the <code>C-z</code> hotkey for emacs-evil-state toggling, I want to have a function that still lets me perform this action quickly.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(defun swarsel/toggle-evil-state ()
  (interactive)
  (if (or (evil-emacs-state-p) (evil-insert-state-p))
      (evil-normal-state)
    (evil-emacs-state)))

</pre>
</div>
</div>
</div>

<div id="outline-container-h:1e0ee570-e509-4ecb-a3af-b75543731bb0" class="outline-4">
<h4 id="h:1e0ee570-e509-4ecb-a3af-b75543731bb0"><span class="section-number-4">3.1.2.</span> Switching to last used buffer</h4>
<div class="outline-text-4" id="text-h:1e0ee570-e509-4ecb-a3af-b75543731bb0">
<p>
I often find myself bouncing between two buffers when I do not want to use a window split. This funnction simply jumps to the last used buffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(defun swarsel/last-buffer () (interactive) (switch-to-buffer nil))

</pre>
</div>
</div>
</div>
