programs/emacs/init.el
(defun swarsel/toggle-evil-state ()
  (interactive)
  (if (or (evil-emacs-state-p) (evil-insert-state-p))
      (evil-normal-state)
    (evil-emacs-state)))

(defun swarsel/last-buffer () (interactive) (switch-to-buffer nil))
