Emacs.html
<div id="outline-container-h:34506761-06b9-43b5-a818-506d9b3faf28" class="outline-4">
<h4 id="h:34506761-06b9-43b5-a818-506d9b3faf28"><span class="section-number-4">3.1.3.</span> mu4e functions</h4>
<div class="outline-text-4" id="text-h:34506761-06b9-43b5-a818-506d9b3faf28">
<p>
I use these functions to let me switch between my main email accounts, as mu4e by itself has trouble doing so. <code>mu4e-switch-account</code> allows for manual choosing of the sender account, while <code>mu4e-rfs--matching-address</code> and <code>mu4e-send-from-correct-address</code> are used when replying to a mail; they switch the sender account to the one that received the mail.
</p>

<p>
By default, the sender email will not be changed after sending a mail; however, I want Emacs to always use my main address when not replying to another email. For that I use <code>mu4e-restore-default</code>.
</p>

<p>
Used here: <a href="#h:b92a18cf-eec3-4605-a8c2-37133ade3574">mu4e</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(defun swarsel/mu4e-switch-account ()
  (interactive)
  (let ((account (completing-read "Select account: " mu4e-user-mail-address-list)))
    (setq user-mail-address account)))

(defun swarsel/mu4e-rfs--matching-address ()
  (cl-loop for to-data in (mu4e-message-field mu4e-compose-parent-message :to)
           for to-email = (pcase to-data
                            (`(_ . email) email)
                            (x (mu4e-contact-email x)))
           for to-name =  (pcase to-data
                            (`(_ . name) name)
                            (x (mu4e-contact-name x)))
           when (mu4e-user-mail-address-p to-email)
           return (list to-name to-email)))

(defun swarsel/mu4e-send-from-correct-address ()
  (when mu4e-compose-parent-message
    (save-excursion
      (when-let ((dest (swarsel/mu4e-rfs--matching-address)))
        (cl-destructuring-bind (from-user from-addr) dest
          (setq user-mail-address from-addr)
          (message-position-on-field "From")
          (message-beginning-of-line)
          (delete-region (point) (line-end-position))
          (insert (format "%s &lt;%s&gt;" (or from-user user-full-name) from-addr)))))))

(defun swarsel/mu4e-restore-default ()
  (setq user-mail-address "leon@swarsel.win"
        user-full-name "Leon Schwarzäugl"))


</pre>
</div>
</div>
</div>
<div id="outline-container-h:4b9d74ef-0376-45bb-bc15-d24a04ca7e81" class="outline-4">
<h4 id="h:4b9d74ef-0376-45bb-bc15-d24a04ca7e81"><span class="section-number-4">3.1.4.</span> Create non-existant directories when finding file</h4>
<div class="outline-text-4" id="text-h:4b9d74ef-0376-45bb-bc15-d24a04ca7e81">
<p>
This function will check if a directory for which a file we want to open exists; if not, it will offer to create the directories for me.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(defun swarsel/with-buffer-name-prompt-and-make-subdirs ()
  (let ((parent-directory (file-name-directory buffer-file-name)))
    (when (and (not (file-exists-p parent-directory))
               (y-or-n-p (format "Directory `%s' does not exist! Create it? " parent-directory)))
      (make-directory parent-directory t))))

(add-to-list 'find-file-not-found-functions #'swarsel/with-buffer-name-prompt-and-make-subdirs)

</pre>
</div>
</div>
</div>
<div id="outline-container-h:91e2f45f-54fa-4b60-8758-b2ef9b439af7" class="outline-4">
<h4 id="h:91e2f45f-54fa-4b60-8758-b2ef9b439af7"><span class="section-number-4">3.1.5.</span> [crux] Duplicate Lines</h4>
<div class="outline-text-4" id="text-h:91e2f45f-54fa-4b60-8758-b2ef9b439af7">
<p>
When programming, I like to be able to duplicate a line. There are easier functions than the one below, but they either
</p>

<ol class="org-ol">
<li>screw with undo/redo</li>
<li>move the cursor wildly</li>
</ol>

<p>
The below function avoids these problems. Originally I used the function <code>duplicate-line</code> found here: <a href="https://stackoverflow.com/questions/88399/how-do-i-duplicate-a-whole-line-in-emacs">https://stackoverflow.com/questions/88399/how-do-i-duplicate-a-whole-line-in-emacs</a>
</p>

<p>
However, this function does not work on regions. Later, I found a solution implemented by <a href="https://github.com/bbatsov/crux">crux</a>. I do not need the whole package, so I just extracted the three functions I needed from it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(defun crux-get-positions-of-line-or-region ()
  "Return positions (beg . end) of the current line or region."
  (let (beg end)
    (if (and mark-active (&gt; (point) (mark)))
        (exchange-point-and-mark))
    (setq beg (line-beginning-position))
    (if mark-active
        (exchange-point-and-mark))
    (setq end (line-end-position))
    (cons beg end)))

(defun crux-duplicate-current-line-or-region (arg)
    "Duplicates the current line or region ARG times.
  If there's no region, the current line will be duplicated.  However, if
  there's a region, all lines that region covers will be duplicated."
    (interactive "p")
    (pcase-let* ((origin (point))
                 (`(,beg . ,end) (crux-get-positions-of-line-or-region))
                 (region (buffer-substring-no-properties beg end)))
      (dotimes (_i arg)
        (goto-char end)
        (newline)
        (insert region)
        (setq end (point)))
      (goto-char (+ origin (* (length region) arg) arg))))

(defun crux-duplicate-and-comment-current-line-or-region (arg)
  "Duplicates and comments the current line or region ARG times.
If there's no region, the current line will be duplicated.  However, if
there's a region, all lines that region covers will be duplicated."
  (interactive "p")
  (pcase-let* ((origin (point))
               (`(,beg . ,end) (crux-get-positions-of-line-or-region))
               (region (buffer-substring-no-properties beg end)))
    (comment-or-uncomment-region beg end)
    (setq end (line-end-position))
    (dotimes (_ arg)
      (goto-char end)
      (newline)
      (insert region)
      (setq end (point)))
    (goto-char (+ origin (* (length region) arg) arg))))

</pre>
</div>
</div>
</div>
