Emacs.html
<div id="outline-container-h:4819720a-9220-4c34-b903-ed4179f3ad1c" class="outline-4">
<h4 id="h:4819720a-9220-4c34-b903-ed4179f3ad1c"><span class="section-number-4">3.1.6.</span> [prot] org-id-headings</h4>
<div class="outline-text-4" id="text-h:4819720a-9220-4c34-b903-ed4179f3ad1c">
<p>
These functions by protesilaos generate heading links in an org-file similar to the normal <code>org-store-link</code> approach when not using properties. This approach has a weakness however - if the heading name is changed, the link breaks. These functions generate a unique identifier for each heading which will not break and also works when exporting the file to html, for example.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(defun prot-org--id-get ()
  "Get the CUSTOM_ID of the current entry.
If the entry already has a CUSTOM_ID, return it as-is, else
create a new one."
  (let* ((pos (point))
         (id (org-entry-get pos "CUSTOM_ID")))
    (if (and id (stringp id) (string-match-p "\\S-" id))
        id
      (setq id (org-id-new "h"))
      (org-entry-put pos "CUSTOM_ID" id)
      id)))

(declare-function org-map-entries "org")

(defun prot-org-id-headlines ()
  "Add missing CUSTOM_ID to all headlines in current file."
  (interactive)
  (org-map-entries
   (lambda () (prot-org--id-get))))

(defun prot-org-id-headline ()
  "Add missing CUSTOM_ID to headline at point."
  (interactive)
  (prot-org--id-get))

</pre>
</div>
</div>
</div>
<div id="outline-container-h:285e5c0a-875d-46a8-bb9b-0222b3d73878" class="outline-4">
<h4 id="h:285e5c0a-875d-46a8-bb9b-0222b3d73878"><span class="section-number-4">3.1.7.</span> Inhibit Messages in Echo Area</h4>
<div class="outline-text-4" id="text-h:285e5c0a-875d-46a8-bb9b-0222b3d73878">
<p>
Emacs likes to send messages to the echo area; this is generally a good thing. However, it bothers me a lot when I am currently working in minibuffer where I receive an echo area message that is actually important and it is then overwritten by e.g. the mu4e update message. This section makes it possible to find the root function calling the message function and disabling it here.
</p>

<p>
Usage: Enable the <code>(advice-add 'message :around #'who-called-me?)</code> by running this code block, which will show a full trace of all messages being sent to the echo area:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(advice-add 'message :around #'who-called-me?)

</pre>
</div>

<p>
Once the root function has been found, it can be disabled via <code>advice=add</code> as in the last block in this section. To disable the stack tracing, run <code>(advice-remove 'message #'who-called-me?)</code> or the following code block:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(advice-remove 'message #'who-called-me?)

</pre>
</div>

<p>
Lastly, individual messages can be reenabled using the <code>(advice-remove '&lt;FUNCTION-NAME&gt; #'suppress-messages)</code> approach. Use this when you accidentally disabled a helpful message.
</p>


<div class="org-src-container">
<pre class="src src-emacs-lisp">
(defun suppress-messages (old-fun &amp;rest args)
  (cl-flet ((silence (&amp;rest args1) (ignore)))
    (advice-add 'message :around #'silence)
    (unwind-protect
        (apply old-fun args)
      (advice-remove 'message #'silence))))

(advice-add 'pixel-scroll-precision :around #'suppress-messages)
(advice-add 'mu4e--server-filter :around #'suppress-messages)
(advice-add 'org-unlogged-message :around #'suppress-messages)
(advice-add 'magit-auto-revert-mode--init-kludge  :around #'suppress-messages)
(advice-add 'push-mark  :around #'suppress-messages)

;; to reenable
;; (advice-remove 'timer-event-handler #'suppress-messages)

(defun who-called-me? (old-fun format &amp;rest args)
  (let ((trace nil) (n 1) (frame nil))
    (while (setf frame (backtrace-frame n))
      (setf n     (1+ n)
            trace (cons (cadr frame) trace)) )
    (apply old-fun (concat "&lt;&lt;%S&gt;&gt;\n" format) (cons trace args))))

;; enable to get message backtrace, the first function shown in backtrace calls the other functions
;; (advice-add 'message :around #'who-called-me?)

;; disable to stop receiving backtrace
(advice-remove 'message #'who-called-me?)


</pre>
</div>
</div>
</div>
<div id="outline-container-h:de249f2a-6a2b-4114-8046-09d1014a7391" class="outline-4">
<h4 id="h:de249f2a-6a2b-4114-8046-09d1014a7391"><span class="section-number-4">3.1.8.</span> Move up one directory for find-file</h4>
<div class="outline-text-4" id="text-h:de249f2a-6a2b-4114-8046-09d1014a7391">
<p>
I find it very annoying that the standard behavior for M-DEL only deletes one word when using find-file. This function makes it so that we always go up by one directory level instead.
</p>

<p>
This function was found here: <a href="https://www.reddit.com/r/emacs/comments/re31i6/how_to_go_up_one_directory_when_using_findfile_cx/">https://www.reddit.com/r/emacs/comments/re31i6/how_to_go_up_one_directory_when_using_findfile_cx/</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(defun up-directory (path)
  "Move up a directory in PATH without affecting the kill buffer."
  (interactive "p")
  (if (string-match-p "/." (minibuffer-contents))
      (let ((end (point)))
        (re-search-backward "/.")
        (forward-char)
        (delete-region (point) end))))

(define-key minibuffer-local-filename-completion-map
            [C-backspace] #'up-directory)

</pre>
</div>
</div>
</div>
<div id="outline-container-h:06b77d28-3fd5-4554-8c7d-32c1b0ec8da5" class="outline-4">
<h4 id="h:06b77d28-3fd5-4554-8c7d-32c1b0ec8da5"><span class="section-number-4">3.1.9.</span> org-mode: General setup</h4>
<div class="outline-text-4" id="text-h:06b77d28-3fd5-4554-8c7d-32c1b0ec8da5">
<p>
Sets up the basic settings that I want to have active in org-mode buffers.
</p>

<p>
Used here: <a href="#h:877c9401-a354-4e44-a235-db1a90d19e00">General org-mode</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(defun swarsel/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  ;;(auto-fill-mode 0)
  (setq display-line-numbers-type 'relative
        display-line-numbers-current-absolute 1
        display-line-numbers-width-start nil
        display-line-numbers-width 6
        display-line-numbers-grow-only 1)
  (add-hook 'org-tab-first-hook 'org-end-of-line)
  (visual-line-mode 1))

</pre>
</div>
</div>
</div>
<div id="outline-container-h:fa710375-2efe-49b4-af6a-a875aca6e4a2" class="outline-4">
<h4 id="h:fa710375-2efe-49b4-af6a-a875aca6e4a2"><span class="section-number-4">3.1.10.</span> org-mode: Visual-fill column</h4>
<div class="outline-text-4" id="text-h:fa710375-2efe-49b4-af6a-a875aca6e4a2">
<p>
This function sets the width of buffers in org-mode.
</p>

<p>
Used in: <a href="#h:bbcfa895-4d46-4b1d-b84e-f634e982c46e">Centered org-mode Buffers</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(defun swarsel/org-mode-visual-fill ()
  (setq visual-fill-column-width 150
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

</pre>
</div>
</div>
</div>
