Emacs.html

<div id="outline-container-h:59d4306e-9b73-4b2c-b039-6a6518c357fc" class="outline-4">
<h4 id="h:59d4306e-9b73-4b2c-b039-6a6518c357fc"><span class="section-number-4">3.1.11.</span> org-mode: Auto-tangle and export Configuration Files</h4>
<div class="outline-text-4" id="text-h:59d4306e-9b73-4b2c-b039-6a6518c357fc">
<p>
This section automatically tangles all configuration blocks in this file to the defined Emacs org-file. It also exports the configuration file as html.
</p>



<div class="org-src-container">
<pre class="src src-emacs-lisp">
(defun swarsel/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      swarsel-emacs-org-filepath)
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-html-export-to-html)
      (org-babel-tangle)))
  (when (string-equal (buffer-file-name)
                      swarsel-nix-org-filepath)
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(setq org-html-htmlize-output-type nil)

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'swarsel/org-babel-tangle-config)))



</pre>
</div>
</div>
</div>

<div id="outline-container-h:dfa66e78-5748-45e3-a975-db3da104bb3a" class="outline-4">
<h4 id="h:dfa66e78-5748-45e3-a975-db3da104bb3a"><span class="section-number-4">3.1.12.</span> org-mode: Fold current heading</h4>
<div class="outline-text-4" id="text-h:dfa66e78-5748-45e3-a975-db3da104bb3a">
<p>
Normally emacs cycles between three states:
</p>

<ol class="org-ol">
<li>fully folded</li>
<li>One heading expanded</li>
<li>All headings expanded</li>
</ol>

<p>
However, I want to be able to fold a single heading consistently.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(defun org-fold-outer ()
  (interactive)
  (org-beginning-of-line)
  (if (string-match "^*+" (thing-at-point 'line t))
      (outline-up-heading 1))
  (outline-hide-subtree)
  )

</pre>
</div>
</div>
</div>

<div id="outline-container-h:a1802f9b-bb71-4fd5-86fa-945da18e8b81" class="outline-4">
<h4 id="h:a1802f9b-bb71-4fd5-86fa-945da18e8b81"><span class="section-number-4">3.1.13.</span> corfu: Do not interrupt navigation</h4>
<div class="outline-text-4" id="text-h:a1802f9b-bb71-4fd5-86fa-945da18e8b81">
<p>
These three functions allow me to keep using the normal navigation keys even when a corfu completion pops up.
</p>

<p>
These functions are used here: <a href="#h:5653d693-ecca-4c95-9633-66b9e3241070">Corfu</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(defun swarsel/corfu-normal-return (&amp;optional arg)
  (interactive)
  (corfu-quit)
  (newline)
  )

(defun swarsel/corfu-quit-and-up (&amp;optional arg)
  (interactive)
  (corfu-quit)
  (evil-previous-visual-line))

(defun swarsel/corfu-quit-and-down (&amp;optional arg)
  (interactive)
  (corfu-quit)
  (evil-next-visual-line))

</pre>
</div>
</div>
</div>

<div id="outline-container-org5fff398" class="outline-4">
<h4 id="org5fff398"><span class="section-number-4">3.1.14.</span> python shell reloading</h4>
<div class="outline-text-4" id="text-3-1-14">
<p>
The standard Emacs behaviour for the Python process shell is a bit annoying. This is my attempt at making it show automatically on opening a python buffer and making it refresh on its own as well. This does not nicely work yet.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
    ;; run the python inferior shell immediately upon entering a python buffer
    ;; (add-hook 'python-mode-hook 'swarsel/run-python)

  ;; (defun swarsel/run-python ()
  ;;   (save-selected-window
  ;;     (switch-to-buffer-other-window (process-buffer (python-shell-get-or-create-process (python-shell-parse-command))))))

;; reload python shell automatically
(defun my-python-shell-run ()
  (interactive)
  (when (get-buffer-process "*Python*")
     (set-process-query-on-exit-flag (get-buffer-process "*Python*") nil)
     (kill-process (get-buffer-process "*Python*"))
     ;; Uncomment If you want to clean the buffer too.
     ;;(kill-buffer "*Python*")
     ;; Not so fast!
     (sleep-for 0.5))
  (run-python (python-shell-parse-command) nil nil)
  (python-shell-send-buffer)
  ;; Pop new window only if shell isnt visible
  ;; in any frame.
  (unless (get-buffer-window "*Python*" t)
    (python-shell-switch-to-shell)))

(defun my-python-shell-run-region ()
  (interactive)
  (python-shell-send-region (region-beginning) (region-end))
  (python-shell-switch-to-shell))

</pre>
</div>
</div>
</div>
</div>
