Emacs.html


<div id="outline-container-h:2b827c27-0de7-45ed-9d9e-6c511e2c6bb5" class="outline-3">
<h3 id="h:2b827c27-0de7-45ed-9d9e-6c511e2c6bb5"><span class="section-number-3">3.2.</span> Custom Keybindings</h3>
<div class="outline-text-3" id="text-h:2b827c27-0de7-45ed-9d9e-6c511e2c6bb5">
<p>
This defines a set of keybinds that I want to have available globally. I have one set of keys that is globally available through the <code>C-SPC</code> prefix. This set is used mostly for functions that I have trouble remembering the original keybind for, or that I just want to have gathered in a common space.
</p>

<p>
I also define some keybinds to some combinations directly. Those are used mostly for custom functions that I call often enough to warrant this.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
;; Make ESC quit prompts
(global-set-key (kbd "&lt;escape&gt;") 'keyboard-escape-quit)

;; Set up general keybindings
(use-package general
  :config
  (general-create-definer swarsel/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")

  (swarsel/leader-keys
    "e"  '(:ignore e :which-key "evil")
    "eo" '(evil-jump-backward :which-key "cursor jump backwards")
    "eO" '(evil-jump-forward :which-key "cursor jump forwards")
    "t"  '(:ignore t :which-key "toggles")
    "ts" '(hydra-text-scale/body :which-key "scale text")
    "te" '(swarsel/toggle-evil-state :which-key "emacs/evil")
    "tl" '(display-line-numbers-mode :which-key "line numbers")
    "tp" '(evil-cleverparens-mode :wk "cleverparens")
    "to" '(olivetti-mode :wk "olivetti")
    "td" '(darkroom-tentative-mode :wk "darkroom")
    "tw" '((lambda () (interactive) (toggle-truncate-lines)) :which-key "line wrapping")
    "m"  '(:ignore m :which-key "modes/programs")
    "mm" '((lambda () (interactive) (mu4e)) :which-key "mu4e")
    "mg" '((lambda () (interactive) (magit-list-repositories)) :which-key "magit-list-repos")
    "mc" '((lambda () (interactive) (swarsel/open-calendar)) :which-key "calendar")
    "mp" '(popper-toggle :which-key "popper")
    "md" '(dirvish :which-key "dirvish")
    "o"  '(:ignore o :which-key "org")
    "op" '((lambda () (interactive) (org-present)) :which-key "org-present")
    "ob" '((lambda () (interactive) (org-babel-mark-block)) :which-key "Mark whole src-block")
    "ol" '((lambda () (interactive) (org-insert-link)) :which-key "insert link")
    "os" '((lambda () (interactive) (org-store-link)) :which-key "store link")
    "od" '((lambda () (interactive) (org-babel-demarcate-block)) :which-key "demarcate (split) src-block")
    ;; "c"  '(:ignore c :which-key "capture")
    ;; "cj" '((lambda () (interactive) (org-capture nil "jj")) :which-key "journal")
    ;; "cs" '(markdown-download-screenshot :which-key "screenshot")
    "l"  '(:ignore l :which-key "links")
    "le" '((lambda () (interactive) (find-file swarsel-emacs-org-filepath)) :which-key "Emacs.org")
    "ls" '((lambda () (interactive) (find-file "/smb:Swarsel@192.168.1.3:")) :which-key "Server")
    "lo" '(dired swarsel-obsidian-vault-directory :which-key "obsidian")
    ;; "la" '((lambda () (interactive) (find-file swarsel-org-anki-filepath)) :which-key "anki")
    "ln" '((lambda () (interactive) (find-file swarsel-nix-org-filepath)) :which-key "Nix.org")
    "lp" '((lambda () (interactive) (projectile-switch-project)) :which-key "switch project")
    "lg" '((lambda () (interactive) (magit-list-repositories)) :which-key "list git repos")
    ;; "a"   '(:ignore a :which-key "anki")
    ;; "ap"  '(anki-editor-push-tree :which-key "push new cards")
    ;; "an"  '((lambda () (interactive) (org-capture nil "a")) :which-key "new card")
    ;; "as"  '(swarsel-anki-set-deck-and-notetype :which-key "change deck and notetype")
    "h"   '(:ignore h :which-key "help")
    "hy"  '(yas-describe-tables :which-key "yas tables")
    "hb"  '(embark-bindings :which-key "current key bindings")
    "h"   '(:ignore t :which-key "describe")
    "he"  'view-echo-area-messages
    "hf"  'describe-function
    "hF"  'describe-face
    "hl"  '(view-lossage :which-key "show command keypresses")
    "hL"  'find-library
    "hm"  'describe-mode
    "ho"  'describe-symbol
    "hk"  'describe-key
    "hK"  'describe-keymap
    "hp"  'describe-package
    "hv"  'describe-variable
    "hd"  'devdocs-lookup
    "w"   '(:ignore t :which-key "window")
    "wl"  'windmove-right
    "wh"  'windmove-left
    "wk"  'windmove-up
    "wj"  'windmove-down
    "wr"  'winner-redo
    "wd"  'delete-window
    "w="  'balance-windows-area
    "wD"  'kill-buffer-and-window
    "wu"  'winner-undo
    "wr"  'winner-redo
    "w/"  'evil-window-vsplit
    "w-"  'evil-window-split
    "wm"  '(delete-other-windows :wk "maximize")
    ))

;; General often used hotkeys
(general-define-key
 "C-M-a" (lambda () (interactive) (org-capture nil "a")) ; make new anki card
 ;; "C-M-d" 'swarsel-obsidian-daily ; open daily obsidian file and create if not exist
 ;; "C-M-S" 'swarsel-anki-set-deck-and-notetype ; switch deck and notetype for new anki cards
 ;; "C-M-s" 'markdown-download-screenshot ; wrapper for org-download-screenshot
 "C-c d" 'crux-duplicate-current-line-or-region
 "C-c D" 'crux-duplicate-and-comment-current-line-or-region
 "&lt;DUMMY-m&gt;" 'swarsel/last-buffer
 "M-\\" 'indent-region
 "C-&lt;f9&gt;" 'my-python-shell-run
 )

</pre>
</div>
</div>
</div>
