Emacs.html
<div id="outline-container-h:07951589-54ba-4e3e-bd7b-4106cd22ff6a" class="outline-3">
<h3 id="h:07951589-54ba-4e3e-bd7b-4106cd22ff6a"><span class="section-number-3">3.3.</span> Directory setup</h3>
<div class="outline-text-3" id="text-h:07951589-54ba-4e3e-bd7b-4106cd22ff6a">
<p>
In this section I setup some aliases that I use for various directories on my system. Some of these are actually used for magit repository finding etc., but many of them serve no real use and I need to clean this up someday.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
;; set Nextcloud directory for journals etc.
(setq swarsel-sync-directory "~/Nextcloud"
      swarsel-emacs-directory "~/.emacs.d"
      swarsel-dotfiles-directory "~/.dotfiles"
      swarsel-projects-directory "~/Documents/GitHub")

(setq swarsel-emacs-org-filepath (expand-file-name "Emacs.org" swarsel-dotfiles-directory)
      swarsel-nix-org-filepath (expand-file-name "Nix.org" swarsel-dotfiles-directory))


;; set Emacs main configuration .org names
(setq swarsel-emacs-org-file "Emacs.org"
      swarsel-anki-org-file "Anki.org"
      swarsel-tasks-org-file "Tasks.org"
      swarsel-archive-org-file "Archive.org"
      swarsel-org-folder-name "Org"
      swarsel-obsidian-daily-folder-name "⭐ Personal/Journal"
      swarsel-obsidian-folder-name "Obsidian"
      swarsel-obsidian-vault-name "Main")


;; set directory paths
(setq swarsel-org-directory (expand-file-name swarsel-org-folder-name  swarsel-sync-directory)) ; path to org folder
(setq swarsel-obsidian-directory (expand-file-name swarsel-obsidian-folder-name swarsel-sync-directory)) ; path to obsidian
(setq swarsel-obsidian-vault-directory (expand-file-name swarsel-obsidian-vault-name swarsel-obsidian-directory)) ; path to obsidian vault
(setq swarsel-obsidian-daily-directory (expand-file-name swarsel-obsidian-daily-folder-name swarsel-obsidian-vault-directory)) ; path to obsidian daily folder

;; filepaths to certain documents
(setq swarsel-org-anki-filepath (expand-file-name swarsel-anki-org-file swarsel-org-directory) ; path to anki export file
      swarsel-org-tasks-filepath (expand-file-name swarsel-tasks-org-file swarsel-org-directory)
      swarsel-org-archive-filepath (expand-file-name swarsel-archive-org-file swarsel-org-directory))

;; set paths to authentication files (forge)
;; (setq auth-source-pass-filename "~/.local/share/password-store"
(setq auth-sources '( "~/.emacs.d/.caldav" "~/.emacs.d/.authinfo.gpg")
      auth-source-cache-expiry nil) ; default is 2h



</pre>
</div>
</div>
</div>

<div id="outline-container-h:0cf30b76-91d9-41da-a10b-74199bc36d40" class="outline-3">
<h3 id="h:0cf30b76-91d9-41da-a10b-74199bc36d40"><span class="section-number-3">3.4.</span> Unclutter .emacs.d</h3>
<div class="outline-text-3" id="text-h:0cf30b76-91d9-41da-a10b-74199bc36d40">
<p>
In this section I move the <code>custom.el</code> out of it's standard location in <code>.emacs.d</code>. Firstly, I dislike using this file at all since I would rather have fully stateful configuration as commanded by this file. Secondly, this file is too easily permanently changed. Recently I figured out the last bits that I needed to remove from custom.el to no longer be reliant on it, so I now just write it to a temporary file (through <code>make-temp=file</code>) which will be cleaned on shutdown. However, I like to retain the custom framework because it is nice for testing out theme customizations, hence why I still load the file.
</p>

<p>
This section also sets the emacs directory to the <code>~/.cache/</code> directory which is useful for files that I do not want to have lying around in my <code>.emacs.d</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
;; Change the user-emacs-directory to keep unwanted things out of ~/.emacs.d
(setq user-emacs-directory (expand-file-name "~/.cache/emacs/")
      url-history-file (expand-file-name "url/history" user-emacs-directory))

;; Use no-littering to automatically set common paths to the new user-emacs-directory
(use-package no-littering)
(setq custom-file (make-temp-file "emacs-custom-"))
(load custom-file t)

</pre>
</div>
</div>
</div>

<div id="outline-container-h:329f529a-ef9f-4787-b311-1c485e05b754" class="outline-3">
<h3 id="h:329f529a-ef9f-4787-b311-1c485e05b754"><span class="section-number-3">3.5.</span> Move backup files to another location</h3>
<div class="outline-text-3" id="text-h:329f529a-ef9f-4787-b311-1c485e05b754">
<p>
Many people dislike the Emacs backup files; I do enjoy them, but have to admit that they clutter the filesystem a little too much. Also, I rarely need to access these over different sessions. Hence I move them to <code>/tmp</code> - if Emacs unexpectedly crashes, the files can be recovered, but the backup files will not gather everywhere and will be deleted upon shutdown.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(let ((backup-dir "~/tmp/emacs/backups")
      (auto-saves-dir "~/tmp/emacs/auto-saves/"))
  (dolist (dir (list backup-dir auto-saves-dir))
    (when (not (file-directory-p dir))
      (make-directory dir t)))
  (setq backup-directory-alist `(("." . ,backup-dir))
        auto-save-file-name-transforms `((".*" ,auto-saves-dir t))
        auto-save-list-file-prefix (concat auto-saves-dir ".saves-")
        tramp-backup-directory-alist `((".*" . ,backup-dir))
        tramp-auto-save-directory auto-saves-dir))

(setq backup-by-copying t    ; Don't delink hardlinks
      delete-old-versions t  ; Clean up the backups
      version-control t      ; Use version numbers on backups,
      kept-new-versions 5    ; keep some new versions
      kept-old-versions 2)   ; and some old ones, too

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-h:786b447d-03ad-4c1d-b114-c37caa2d591c" class="outline-2">
<h2 id="h:786b447d-03ad-4c1d-b114-c37caa2d591c"><span class="section-number-2">4.</span> General init.el setup + UI</h2>
<div class="outline-text-2" id="text-h:786b447d-03ad-4c1d-b114-c37caa2d591c">
<p>
In this general section I have settings that I either consider to be integral to my experience when using emacs or have no other section that I feel they belong to.
</p>
</div>
