Emacs.html

<div id="outline-container-h:76a5bd78-a20d-4068-bea8-a38fdb26428e" class="outline-3">
<h3 id="h:76a5bd78-a20d-4068-bea8-a38fdb26428e"><span class="section-number-3">4.1.</span> General setup</h3>
<div class="outline-text-3" id="text-h:76a5bd78-a20d-4068-bea8-a38fdb26428e">
<p>
Here I set up some things that are too minor to put under other categories.
</p>
<ul class="org-ul">
<li>Firstly we disable to having to type `yes` and `no` and switch it to `y` and `n`.</li>
<li>We also enable the marking of trailing whitespaces.</li>
<li>Also, make emacs highlight the current line globally</li>
<li>Emacs defaults to pausing all display redrawing on any input. This may have been useful previously, but is not necessary nowadays.</li>
<li>I also disable the suspend-frame function, as I never use it and it is quite confusing when accidentally hitting the keys for it.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
;; use UTF-8 everywhere
(set-language-environment "UTF-8")

;; set default font size
(defvar swarsel/default-font-size 130)
(setq swarsel-standard-font "FiraCode Nerd Font Mono"
      swarsel-alt-font "FiraCode Nerd Font Mono")

;; (defalias 'yes-or-no-p 'y-or-n-p)
;;(setq-default show-trailing-whitespace t)
(add-hook 'before-save-hook 'delete-trailing-whitespace)
(global-hl-line-mode 1)
;; (setq redisplay-dont-pause t) ;; obsolete
(setq blink-cursor-mode nil) ;; blink-cursor is an unexpected source of slowdown
(global-subword-mode 1) ; Iterate through CamelCase words
(setq blink-matching-paren nil) ;; this makes the cursor jump around annoyingly
(delete-selection-mode 1)
(setq vc-follow-symlinks t)
(setq require-final-newline t)
(winner-mode 1)
(setq load-prefer-newer t)

(setq undo-limit 80000000
      evil-want-fine-undo t
      auto-save-default t
      password-cache-expiry nil
      )
(setq browse-url-browser-function 'browse-url-firefox)
;; disable a keybind that does more harm than good
(global-set-key [remap suspend-frame]
                (lambda ()
                  (interactive)
                  (message "This keybinding is disabled (was 'suspend-frame')")))

(setq visible-bell nil)
(setq initial-major-mode 'fundamental-mode
      initial-scratch-message nil)

(add-hook 'prog-mode-hook 'display-line-numbers-mode)
(add-hook 'text-mode-hook 'display-line-numbers-mode)

</pre>
</div>
</div>
</div>

<div id="outline-container-h:0debe8fd-b319-4ab7-a92c-784fa7896b75" class="outline-3">
<h3 id="h:0debe8fd-b319-4ab7-a92c-784fa7896b75"><span class="section-number-3">4.2.</span> Mark all themes as safe</h3>
<div class="outline-text-3" id="text-h:0debe8fd-b319-4ab7-a92c-784fa7896b75">
<p>
Normally when switching themes in emacs, the user will be warned that themes can run malicious code. I only run one theme really and deem it safe. It is however annoying to be asked this on every new system and it also creates lines in custom.el to answer that query, so here I declare all themes as safe.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(setq custom-safe-themes t)

</pre>
</div>
</div>
</div>
<div id="outline-container-h:b587e869-9911-443b-bc6d-8fb3ce31908d" class="outline-3">
<h3 id="h:b587e869-9911-443b-bc6d-8fb3ce31908d"><span class="section-number-3">4.3.</span> Show less compilation warnings</h3>
<div class="outline-text-3" id="text-h:b587e869-9911-443b-bc6d-8fb3ce31908d">
<p>
When Emacs compiles stuff, it often shows a bunch of warnings that I do not need to deal with. Here we silence those. Some will be disabled completely, and some only when we have native compilation available (which should be most of the time, however).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))
;; Make native compilation silent and prune its cache.
(when (native-comp-available-p)
  (setq native-comp-async-report-warnings-errors 'silent) ; Emacs 28 with native compilation
  (setq native-compile-prune-cache t)) ; Emacs 29

</pre>
</div>
</div>
</div>

<div id="outline-container-h:6527b3ce-b76d-431a-9960-a57da7c53e1b" class="outline-3">
<h3 id="h:6527b3ce-b76d-431a-9960-a57da7c53e1b"><span class="section-number-3">4.4.</span> Indentation</h3>
<div class="outline-text-3" id="text-h:6527b3ce-b76d-431a-9960-a57da7c53e1b">
<p>
Here I define several options related to indentation; I first make it so that only whitespace will be used instead of tab characters for indentation, and I also set a small standard indent.
</p>

<p>
We set <code>tab-always-indent</code> to <code>'complete</code> in order to indent first and then do completion if there are any. Also we make it so that python will not complain about missing indentation info.
</p>

<p>
Lastly, I load the <code>highlight-indent-guides</code> package. This adds a neat visual indicator of the indentation level, which is useful for languages like python.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(setq-default indent-tabs-mode nil
              tab-width 2)

(setq tab-always-indent 'complete)
(setq python-indent-guess-indent-offset-verbose nil)

(use-package highlight-indent-guides
  :hook (prog-mode . highlight-indent-guides-mode)
  :init
  (setq highlight-indent-guides-method 'column)
  (setq highlight-indent-guides-responsive 'top)
  )

(with-eval-after-load 'highlight-indent-guides
  (set-face-attribute 'highlight-indent-guides-even-face nil :background "gray10")
  (set-face-attribute 'highlight-indent-guides-odd-face nil :background "gray20")
  (set-face-attribute 'highlight-indent-guides-stack-even-face nil :background "gray40")
  (set-face-attribute 'highlight-indent-guides-stack-odd-face nil :background "gray50"))
</pre>
</div>
</div>
</div>

<div id="outline-container-h:3dc9fb1d-cd16-4bd0-a9ac-55a944415a90" class="outline-3">
<h3 id="h:3dc9fb1d-cd16-4bd0-a9ac-55a944415a90"><span class="section-number-3">4.5.</span> Scrolling</h3>
<div class="outline-text-3" id="text-h:3dc9fb1d-cd16-4bd0-a9ac-55a944415a90">
<p>
By default, emacs scrolls half a page when reaching the bottom of the buffer. This is extremely annoying. This sets up more granular scrolling that allows scrolling with a mouse wheel or the two-finger touchscreen gesture. This now also works in buffers with a very small frame.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(setq mouse-wheel-scroll-amount
      '(1
        ((shift) . 5)
        ((meta) . 0.5)
        ((control) . text-scale))
      mouse-drag-copy-region nil
      make-pointer-invisible t
      mouse-wheel-progressive-speed t
      mouse-wheel-follow-mouse t)

(setq-default scroll-preserve-screen-position t
              scroll-conservatively 1
              scroll-margin 0
              next-screen-context-lines 0)

(pixel-scroll-precision-mode 1)

</pre>
</div>
</div>
</div>
