Emacs.html

<div id="outline-container-h:5bf9f014-ee96-42da-b285-7b34f04e6bb1" class="outline-3">
<h3 id="h:5bf9f014-ee96-42da-b285-7b34f04e6bb1"><span class="section-number-3">4.6.</span> Evil</h3>
<div class="outline-text-3" id="text-h:5bf9f014-ee96-42da-b285-7b34f04e6bb1">
</div>

<div id="outline-container-h:218376e8-086b-46bf-91b3-78295d5d440f" class="outline-4">
<h4 id="h:218376e8-086b-46bf-91b3-78295d5d440f"><span class="section-number-4">4.6.1.</span> General evil</h4>
<div class="outline-text-4" id="text-h:218376e8-086b-46bf-91b3-78295d5d440f">
<p>
This setups up evil, which brings vim-like keybindings to emacs. In the same location, I also unbind the <code>C-z</code> key (I am very unhappy with this implementation, but it is the only thing that works consistently so far) to make it available for <a href="#h:c3cc1c12-3ab8-42b7-be07-63f54eac397f">cape</a> later.
</p>

<p>
Also, I setup initial modes for several major-modes depending on what I deem fit.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
;; Emulate vim in emacs
(use-package evil
  :init
  (setq evil-want-integration t) ; loads evil
  (setq evil-want-keybinding nil) ; loads "helpful bindings" for other modes
  (setq evil-want-C-u-scroll t) ; scrolling using C-u
  (setq evil-want-C-i-jump nil) ; jumping with C-i
  (setq evil-want-Y-yank-to-eol t) ; give Y some utility
  (setq evil-shift-width 2) ; uniform indent
  (setq evil-respect-visual-line-mode t) ; i am torn on this one
  (setq evil-split-window-below t)
  (setq evil-vsplit-window-right t)
  :config
  (evil-mode 1)
  (define-key evil-normal-state-map (kbd "C-z") nil)
  (define-key evil-insert-state-map (kbd "C-z") nil)
  (define-key evil-visual-state-map (kbd "C-z") nil)
  (define-key evil-motion-state-map (kbd "C-z") nil)
  (define-key evil-operator-state-map (kbd "C-z") nil)
  (define-key evil-replace-state-map (kbd "C-z") nil)
  (define-key global-map (kbd "C-z") nil)
  (evil-set-undo-system 'undo-tree)

  ;; Don't use evil-mode in these contexts, or use it in a specific mode
  (evil-set-initial-state 'messages-buffer-mode 'emacs)
  (evil-set-initial-state 'dashboard-mode 'emacs)
  (evil-set-initial-state 'dired-mode 'emacs)
  (evil-set-initial-state 'cfw:details-mode 'emacs)
  (evil-set-initial-state 'Custom-mode 'emacs) ; god knows why this mode is in uppercase
  (evil-set-initial-state 'mu4e-headers-mode 'normal)
  (evil-set-initial-state 'python-inferior-mode 'normal)
  (add-hook 'org-capture-mode-hook 'evil-insert-state)
  (add-to-list 'evil-buffer-regexps '("COMMIT_EDITMSG" . insert)))

</pre>
</div>
</div>
</div>
<div id="outline-container-h:bde208f3-01ef-4dc6-9981-65f3d2a8189b" class="outline-4">
<h4 id="h:bde208f3-01ef-4dc6-9981-65f3d2a8189b"><span class="section-number-4">4.6.2.</span> evil-collection</h4>
<div class="outline-text-4" id="text-h:bde208f3-01ef-4dc6-9981-65f3d2a8189b">
<p>
This gives support for many different modes, and works beautifully out of the box.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package evil-collection
  :after evil
  :config
  (evil-collection-init)
  (setq forge-add-default-bindings nil))
</pre>
</div>
</div>
</div>
<div id="outline-container-h:d80e3f7d-0185-4a15-832b-d756e576265c" class="outline-4">
<h4 id="h:d80e3f7d-0185-4a15-832b-d756e576265c"><span class="section-number-4">4.6.3.</span> evil-snipe</h4>
<div class="outline-text-4" id="text-h:d80e3f7d-0185-4a15-832b-d756e576265c">
<p>
This package changes the char-search commands like <code>f</code> by showing the results in a more visual manner. It also gives a 2-character search using <code>s</code> and <code>S</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">;; enables 2-char inline search
  (use-package evil-snipe
    :after evil
    :demand
    :config
    (evil-snipe-mode +1)
    ;; replace 1-char searches (f&amp;t) with this better UI
    (evil-snipe-override-mode +1))
</pre>
</div>
</div>
</div>

<div id="outline-container-h:b06a378d-5248-4451-8eee-e65a3a768b1d" class="outline-4">
<h4 id="h:b06a378d-5248-4451-8eee-e65a3a768b1d"><span class="section-number-4">4.6.4.</span> evil-cleverparens</h4>
<div class="outline-text-4" id="text-h:b06a378d-5248-4451-8eee-e65a3a768b1d">
<p>
This helps keeping parentheses balanced which is useful when writing in languages like Elisp. I do not activate this by default, as most languages do not profit from this enough in my eyes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">;; for parentheses-heavy languades modify evil commands to keep balance of parantheses
(use-package evil-cleverparens)

</pre>
</div>
</div>
</div>

<div id="outline-container-h:aac82e5e-d882-4870-b644-ebdd0a2daae3" class="outline-4">
<h4 id="h:aac82e5e-d882-4870-b644-ebdd0a2daae3"><span class="section-number-4">4.6.5.</span> evil-surround</h4>
<div class="outline-text-4" id="text-h:aac82e5e-d882-4870-b644-ebdd0a2daae3">
<p>
This minor-mode adds functionality for doing better surround-commands; for example <code>ci[</code> will let you change the word within square brackets.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
;; enables surrounding text with S
(use-package evil-surround
  :config
  (global-evil-surround-mode 1))

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-h:e888d7a7-1755-4109-af11-5358b8cf140e" class="outline-3">
<h3 id="h:e888d7a7-1755-4109-af11-5358b8cf140e"><span class="section-number-3">4.7.</span> ispell</h3>
<div class="outline-text-3" id="text-h:e888d7a7-1755-4109-af11-5358b8cf140e">
<p>
This should setup a wordlist that can be used as a dictionary. However, for some reason this does not work, and I will need to further investigate this issue.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
;; set the NixOS wordlist by hand
(setq ispell-alternate-dictionary "/nix/store/gjmvnbs97cnw19wnqh9m075cdbhy8r8g-wordlist-WORDLIST")

</pre>
</div>
</div>
</div>

<div id="outline-container-h:60f87342-0491-4c56-8057-6f075cf35753" class="outline-3">
<h3 id="h:60f87342-0491-4c56-8057-6f075cf35753"><span class="section-number-3">4.8.</span> Font Configuration</h3>
<div class="outline-text-3" id="text-h:60f87342-0491-4c56-8057-6f075cf35753">
<p>
Here I define my fonts to be used. Honestly I do not understand the face-attributes and pitches of emacs all too well. It seems this configuration works fine, but I might have to revisit this at some point in the future.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(dolist (face '(default fixed-pitch))
  (set-face-attribute face nil
                      :font "FiraCode Nerd Font Mono"))
(add-to-list 'default-frame-alist '(font . "FiraCode Nerd Font Mono"))

(set-face-attribute 'default nil :height 100)
(set-face-attribute 'fixed-pitch nil :height 1.0)

(set-face-attribute 'variable-pitch nil
                    :family "IBM Plex Sans"
                    :weight 'regular
                    :height 1.06)

;; these settings used to be in custom.el

</pre>
</div>
</div>
</div>
