Emacs.html

<div id="outline-container-h:72a9704b-83d2-4b74-a1f6-d333203f62db" class="outline-3">
<h3 id="h:72a9704b-83d2-4b74-a1f6-d333203f62db"><span class="section-number-3">4.9.</span> Theme</h3>
<div class="outline-text-3" id="text-h:72a9704b-83d2-4b74-a1f6-d333203f62db">
<p>
I have grown to love the <code>doom-citylights</code> theme and have modeled my whole system after it. Also solaire-mode is a nice mode that inverts the alt-faces with the normal faces for specific 'minor' buffers (like Help-buffers).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package solaire-mode
  :custom
  (solaire-global-mode +1))

(use-package doom-themes
  :hook
  (server-after-make-frame . (lambda () (load-theme
                                         'doom-city-lights t)))
  :config
  (load-theme 'doom-city-lights t)
  (doom-themes-treemacs-config)
  (doom-themes-org-config))

</pre>
</div>
</div>
</div>

<div id="outline-container-h:eb0ea526-a83a-4664-b3a1-2b40d3a31493" class="outline-3">
<h3 id="h:eb0ea526-a83a-4664-b3a1-2b40d3a31493"><span class="section-number-3">4.10.</span> Icons</h3>
<div class="outline-text-3" id="text-h:eb0ea526-a83a-4664-b3a1-2b40d3a31493">
<p>
This section loads the base icons used in my configuration. I am using <code>nerd-icons</code> over <code>all-the-icons</code> since the former seems to have more integrations with different packages than the latter.
</p>

<p>
Used in:
</p>
<ul class="org-ul">
<li><a href="#h:b190d512-bfb5-42ec-adec-8d86bab726ce">Vertico and friends</a></li>
<li><a href="#h:5653d693-ecca-4c95-9633-66b9e3241070">IN USE Corfu</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package nerd-icons)

</pre>
</div>
</div>
</div>

<div id="outline-container-h:455ed7ac-ee7f-4f94-b857-f2c58b2282d0" class="outline-3">
<h3 id="h:455ed7ac-ee7f-4f94-b857-f2c58b2282d0"><span class="section-number-3">4.11.</span> Variable Pitch Mode</h3>
<div class="outline-text-3" id="text-h:455ed7ac-ee7f-4f94-b857-f2c58b2282d0">
<p>
This minor mode allows mixing fixed and variable pitch fonts within the same buffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package mixed-pitch
  :custom
  (mixed-pitch-set-height nil)
  (mixed-pitch-variable-pitch-cursor nil)
  :hook
  (text-mode . mixed-pitch-mode))


</pre>
</div>
</div>
</div>

<div id="outline-container-h:ed585848-875a-4673-910c-d2e1901dd95b" class="outline-3">
<h3 id="h:ed585848-875a-4673-910c-d2e1901dd95b"><span class="section-number-3">4.12.</span> Modeline</h3>
<div class="outline-text-3" id="text-h:ed585848-875a-4673-910c-d2e1901dd95b">
<p>
Here I set up the modeline with some information that I find useful. Specficially I am using the doom modeline. Most informations I disable for it, except for the cursor information (row + column) as well as a widget for <code>mu4e</code> and git information.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package doom-modeline
  :init
  (doom-modeline-mode)
  (column-number-mode)
  :custom
  ((doom-modeline-height 22)
   (doom-modeline-indent-info nil)
   (doom-modeline-buffer-encoding nil)))


</pre>
</div>
</div>
</div>

<div id="outline-container-h:39ae01e9-8053-4f76-aa77-8cbbbcff9652" class="outline-3">
<h3 id="h:39ae01e9-8053-4f76-aa77-8cbbbcff9652"><span class="section-number-3">4.13.</span> Helper Modes</h3>
<div class="outline-text-3" id="text-h:39ae01e9-8053-4f76-aa77-8cbbbcff9652">
</div>
<div id="outline-container-h:b190d512-bfb5-42ec-adec-8d86bab726ce" class="outline-4">
<h4 id="h:b190d512-bfb5-42ec-adec-8d86bab726ce"><span class="section-number-4">4.13.1.</span> Vertico, Orderless, Marginalia, Consult, Embark</h4>
<div class="outline-text-4" id="text-h:b190d512-bfb5-42ec-adec-8d86bab726ce">
<p>
This set of packages uses the default emacs completion framework and works together to provide a very nice user experience:
</p>

<ul class="org-ul">
<li>Vertico simply provides a vertically stacking completion</li>
<li>Marginalia adds more information to completion results</li>
<li>Orderless allows for fuzzy matching</li>
<li>Consult provides better implementations for several user functions, e.g. <code>consult-line</code> or <code>consult-outline</code></li>
<li>Embark allows acting on the results in the minibuffer while the completion is still ongoing - this is extremely useful since it allows to, for example, read the documentation for several functions without closing the help search. It can also collect the results of a grep operation into a seperate buffer that edits the result in their original location.</li>
</ul>

<p>
Nerd icons is originally enabled here: <a href="#h:eb0ea526-a83a-4664-b3a1-2b40d3a31493">Icons</a>
</p>
</div>

<ol class="org-ol">
<li><a id="h:d7c7f597-f870-4e01-8f7e-27dd31dd245d"></a>vertico<br />
<div class="outline-text-5" id="text-h:d7c7f597-f870-4e01-8f7e-27dd31dd245d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(setq read-buffer-completion-ignore-case t
      read-file-name-completion-ignore-case t
      completion-ignore-case t)

(use-package vertico
  :custom
  (vertico-scroll-margin 0)
  (vertico-count 10)
  (vertico-resize t)
  (vertico-cycle t)
  :init
  (vertico-mode)
  (vertico-mouse-mode))
</pre>
</div>
</div>
</li>

<li><a id="h:10d4f2bd-8c72-430b-a9ed-9b5e279ec0b4"></a>vertico-directory<br />
<div class="outline-text-5" id="text-h:10d4f2bd-8c72-430b-a9ed-9b5e279ec0b4">
<p>
This package allows for <code>Ido</code>-like directory navigation.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package vertico-directory
  :ensure nil
  :after vertico
  :bind (:map vertico-map
              ("RET" . vertico-directory-enter)
              ("C-DEL" . vertico-directory-delete-word)
              ("DEL" . vertico-directory-delete-char))
  ;; Tidy shadowed file names
  :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))

</pre>
</div>
</div>
</li>

<li><a id="h:211fc0bd-0d64-4577-97d8-6abc94435f04"></a>orderless<br />
<div class="outline-text-5" id="text-h:211fc0bd-0d64-4577-97d8-6abc94435f04">
<p>
The completion styles that I chose here can possibly still be improved. I need to spend more time on this.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package orderless
  :custom
  (completion-styles '(orderless flex basic))
  (completion-category-overrides '((file (styles . (partial-completion)))
                                   (eglot (styles orderless)))))

</pre>
</div>
</div>
</li>

<li><a id="h:49ab82bf-812d-4fbe-a5b6-d3ad703fe32c"></a>consult<br />
<div class="outline-text-5" id="text-h:49ab82bf-812d-4fbe-a5b6-d3ad703fe32c">
<p>
The big winner here are the convenient keybinds being setup here for general use. Also, I setup vim-navigation for minibuffer completions. <code>consult-buffer</code> is set twice because I am still used to that weird <code>C-M-j</code> command that I chose for <code>ivy-switch-buffer</code> when I first started using Emacs. I want to move to the other command but for now it is not feasible to delete the other one.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package consult
  :config
  (setq consult-fontify-max-size 1024)
  :bind
  (("C-x b" . consult-buffer)
   ("C-c &lt;C-m&gt;" . consult-global-mark)
   ("C-c C-a" . consult-org-agenda)
   ("C-x O" . consult-org-heading)
   ("C-M-j" . consult-buffer)
   ("C-s" . consult-line)
   ("M-g M-g" . consult-goto-line)
   ("M-g i" . consult-imenu)
   ("M-s M-s" . consult-line-multi)
   :map minibuffer-local-map
   ("C-j" . next-line)
   ("C-k" . previous-line)))

</pre>
</div>
</div>
</li>
