Emacs.html
<li><a id="h:1c564ee5-ccd7-48be-b69a-d963400c4704"></a>embark<br />
<div class="outline-text-5" id="text-h:1c564ee5-ccd7-48be-b69a-d963400c4704">
<p>
I have stripped down the embark keybinds heavily. It is very useful to me even in it's current state, but it quickly becomes overwhelming. <code>embark-dwim</code> acts on a candidate without closing the minibuffer, which is very useful. <code>embark-act</code> lets the user choose from all actions, but has an overwhelming interface.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package embark
  :bind
  (("C-." . embark-act)
   ("M-." . embark-dwim)
   ("C-h B" . embark-bindings)
   ("C-c c" . embark-collect))
  :custom
  (prefix-help-command #'embark-prefix-help-command)
  (embark-quit-after-action '((t . nil)))
  :config
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none)))))

</pre>
</div>
</div>
</li>
<li><a id="h:6287551c-a6f7-4870-b3f3-210d6f038b6f"></a>embark-consult<br />
<div class="outline-text-5" id="text-h:6287551c-a6f7-4870-b3f3-210d6f038b6f">
<p>
Provides previews for embark.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package embark-consult
  :after (embark consult)
  :demand t ; only necessary if you have the hook below
  ;; if you want to have consult previews as you move around an
  ;; auto-updating embark collect buffer
  :hook
  (embark-collect-mode . consult-preview-at-point-mode))
</pre>
</div>
</div>
</li>
<li><a id="h:f32040a4-882f-4e6b-97f1-a0105c44c034"></a>marginalia<br />
<div class="outline-text-5" id="text-h:f32040a4-882f-4e6b-97f1-a0105c44c034">
<p>
I set the annotation-mode of marginalia to <code>heavy</code>. This gives even more information on the stuff that you are looking at. One thing I am missing from ivy is the highlighting on <code>mode</code>-commands based on the current state of the mode. Also, I do not understand all the shorthands used by marginalia yet.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package marginalia
  :after vertico
  :init
  (marginalia-mode)
  (setq marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil)))

</pre>
</div>
</div>
</li>
<li><a id="h:d70ec2fb-da43-4523-9ee4-774ececdb80e"></a>nerd-icons-completion<br />
<div class="outline-text-5" id="text-h:d70ec2fb-da43-4523-9ee4-774ececdb80e">
<p>
As stated above, this simply provides nerd-icons to the completion framework.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package nerd-icons-completion
  :after (marginalia nerd-icons)
  :hook (marginalia-mode . nerd-icons-completion-marginalia-setup)
  :init
  (nerd-icons-completion-mode))


</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-h:cbf6bd48-2503-489a-89da-e3359564e989" class="outline-4">
<h4 id="h:cbf6bd48-2503-489a-89da-e3359564e989"><span class="section-number-4">4.13.2.</span> Helpful + which-key: Better help defaults</h4>
<div class="outline-text-4" id="text-h:cbf6bd48-2503-489a-89da-e3359564e989">
<p>
This pair of packages provides information on keybinds in addition to function names, which makes it easier to remember keybinds (<code>which-key</code>). The <code>helpful</code> package provides a better <code>Help</code> framework for Emacs. For some reason, the Help windows are always being focused by the cursor even though I have set <code>help-window-select</code> to nil. I do not understand why.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.3))

(use-package helpful
  :bind
  (("C-h f" . helpful-callable)
   ("C-h v" . helpful-variable)
   ("C-h k" . helpful-key)
   ("C-h C-." . helpful-at-point))
  :config
  (setq help-window-select nil))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-h:bbbd9cc8-3a84-4810-a3d5-b8536a5fbda1" class="outline-3">
<h3 id="h:bbbd9cc8-3a84-4810-a3d5-b8536a5fbda1"><span class="section-number-3">4.14.</span> Ligatures</h3>
<div class="outline-text-3" id="text-h:bbbd9cc8-3a84-4810-a3d5-b8536a5fbda1">
<p>
Personally, I think ligatures are fancy. With this mode, they stay 'cursorable'. However, I do not need them in all modes, so I only use them in programming modes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package ligature
  :init
  (global-ligature-mode t)
  :config
  (ligature-set-ligatures 'prog-mode
                          '("|||&gt;" "&lt;|||" "&lt;==&gt;" "&lt;!--" "####" "~~&gt;" "***" "||=" "||&gt;"
                            ":::" "::=" "=:=" "===" "==&gt;" "=!=" "=&gt;&gt;" "=&lt;&lt;" "=/=" "!=="
                            "!!." "&gt;=&gt;" "&gt;&gt;=" "&gt;&gt;&gt;" "&gt;&gt;-" "&gt;-&gt;" "-&gt;&gt;" "--&gt;" "---" "-&lt;&lt;"
                            "&lt;~~" "&lt;~&gt;" "&lt;*&gt;" "&lt;||" "&lt;|&gt;" "&lt;$&gt;" "&lt;==" "&lt;=&gt;" "&lt;=&lt;" "&lt;-&gt;"
                            "&lt;--" "&lt;-&lt;" "&lt;&lt;=" "&lt;&lt;-" "&lt;&lt;&lt;" "&lt;+&gt;" "&lt;/&gt;" "###" "#_(" "..&lt;"
                            "..." "+++" "/==" "///" "_|_" "www" "&amp;&amp;" "^=" "~~" "~@" "~="
                            "~&gt;" "~-" "**" "*&gt;" "*/" "||" "|}" "|]" "|=" "|&gt;" "|-" "{|"
                            "[|" "]#" "::" ":=" ":&gt;" ":&lt;" "$&gt;" "==" "=&gt;" "!=" "!!" "&gt;:"
                            "&gt;=" "&gt;&gt;" "&gt;-" "-~" "-|" "-&gt;" "--" "-&lt;" "&lt;~" "&lt;*" "&lt;|" "&lt;:"
                            "&lt;$" "&lt;=" "&lt;&gt;" "&lt;-" "&lt;&lt;" "&lt;+" "&lt;/" "#{" "#[" "#:" "#=" "#!"
                            "##" "#(" "#?" "#_" "%%" ".=" ".." ".?" "+&gt;" "++" "?:" "?="
                            "?." "??" "/*" "/=" "/&gt;" "//" "__" "~~" "(*" "*)" "\\\\"
                            "://" ";;")))

</pre>
</div>
</div>
</div>
