Emacs.html

<div id="outline-container-h:e9d40e63-0e1f-47df-98f7-5427992588a4" class="outline-3">
<h3 id="h:e9d40e63-0e1f-47df-98f7-5427992588a4"><span class="section-number-3">4.15.</span> Popup (popper) + Shackle Buffers</h3>
<div class="outline-text-3" id="text-h:e9d40e63-0e1f-47df-98f7-5427992588a4">
<p>
The popper package allows to declare different buffers as 'popup-type', which sort of acts like a scratchpad. It can be toggled at any time using <code>popper-toggle</code> and the resulting frame can be freely customized (with <code>shackle</code>) to a certain size. It is also possible to prevent a buffer from appearing - I do this for example to the <code>*Warnings*</code> buffer, since usually I am not interested in it's output.
</p>

<p>
<code>popper-echo-mode</code> shows all buffers that are currently stored as a popup in the echo area when a popup is opened - this is useful since you can cycle between all popup buffers.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package popper
  :bind (("M-["   . popper-toggle))
  :init
  (setq popper-reference-buffers
        '("\\*Messages\\*"
          ("\\*Warnings\\*" . hide)
          "Output\\*$"
          "\\*Async Shell Command\\*"
          "\\*Async-native-compile-log\\*"
          help-mode
          helpful-mode
          "*Occur*"
          "*scratch*"
          "*julia*"
          "*Python*"
          ;; ("*tex-shell*" . hide)
          (compilation-mode . hide)))
  (popper-mode +1)
  (popper-echo-mode +1))

(use-package shackle
  :config
  (setq shackle-rules '(("*Messages*" :select t :popup t :align right :size 0.3)
                        ("*Warnings*" :ignore t :popup t :align right :size 0.3)
                        ("*Occur*" :select t :popup t :align below :size 0.2)
                        ("*scratch*" :select t :popup t :align below :size 0.2)
                        ("*Python*" :select t :popup t :align below :size 0.2)
                        ("*tex-shell*" :ignore t :popup t :align below :size 0.2)
                        (helpful-mode :select t :popup t :align right :size 0.35)
                        (help-mode :select t :popup t :align right :size 0.4)))
  (shackle-mode 1))

</pre>
</div>
</div>
</div>
<div id="outline-container-h:a6d23c8c-125f-4e36-af30-ff0a1e0d5a28" class="outline-3">
<h3 id="h:a6d23c8c-125f-4e36-af30-ff0a1e0d5a28"><span class="section-number-3">4.16.</span> Indicate first and last line of buffer</h3>
<div class="outline-text-3" id="text-h:a6d23c8c-125f-4e36-af30-ff0a1e0d5a28">
<p>
This places little angled indicators on the fringe of a window which indicate buffer boundaries. This is not super useful, but makes use of a space that I want to keep for aesthetic reasons anyways and makes it a bit more useful in the process.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(setq-default indicate-buffer-boundaries t)

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-h:f2622fd3-7f14-47a8-8c21-33574fcbf14b" class="outline-2">
<h2 id="h:f2622fd3-7f14-47a8-8c21-33574fcbf14b"><span class="section-number-2">5.</span> Modules</h2>
<div class="outline-text-2" id="text-h:f2622fd3-7f14-47a8-8c21-33574fcbf14b">
<p>
This section houses all configuration bits that are related to a specific package that is not fundamental to my Emacs experience.
</p>

<p>
At some point this will receive further sorting, but for now this is good enough.
</p>
</div>

<div id="outline-container-h:99544398-72af-4382-b8e1-01b2221baff4" class="outline-3">
<h3 id="h:99544398-72af-4382-b8e1-01b2221baff4"><span class="section-number-3">5.1.</span> Org Mode</h3>
<div class="outline-text-3" id="text-h:99544398-72af-4382-b8e1-01b2221baff4">
<p>
org-mode is probably my most-used mode in Emcas. It acts as my organizer, config management tool and calender even.
</p>

<p>
Note that nearly all headings within the <code>Org-mode</code> heading are coded within the <code>use-package</code> setup, so be very careful about moving stuff about here.
</p>
</div>

<div id="outline-container-h:877c9401-a354-4e44-a235-db1a90d19e00" class="outline-4">
<h4 id="h:877c9401-a354-4e44-a235-db1a90d19e00"><span class="section-number-4">5.1.1.</span> General org-mode</h4>
<div class="outline-text-4" id="text-h:877c9401-a354-4e44-a235-db1a90d19e00">
<p>
This sets up the basic org-mode. I wrote a function to handle some of the initial org-mode behaviour in <a href="#h:06b77d28-3fd5-4554-8c7d-32c1b0ec8da5">org-mode setup.
</a>
This part of the configuration mostly makes some aesthetic changes, enables neat LaTeX and points Emacs to some files that it needs for org-mode
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package org
  ;;:diminish (org-indent-mode)
  :hook (org-mode . swarsel/org-mode-setup)
  :bind
  (("C-&lt;tab&gt;" . org-fold-outer)
  ("C-c s" . org-store-link))
  :config
  (setq org-ellipsis " ⤵"
        org-link-descriptive t
        org-hide-emphasis-markers t)
  (setq org-startup-folded t)
  (setq org-support-shift-select t)

  ;; (setq org-agenda-start-with-log-mode t)
  ;; (setq org-log-done 'time)
  ;; (setq org-log-into-drawer t)
  (setq org-startup-with-inline-images t)
  (setq org-image-actual-width nil)
  (setq org-format-latex-options '(:foreground "White" :background default :scale 2.0 :html-foreground "Black" :html-background "Transparent" :html-scale 1.0 :matchers ("begin" "$1" "$" "$$" "\\(" "\\[")))

</pre>
</div>
</div>
</div>
