Emacs.html
<div id="outline-container-h:2b3b4eb6-68a1-476d-b5d1-940a21484f1d" class="outline-4">
<h4 id="h:2b3b4eb6-68a1-476d-b5d1-940a21484f1d"><span class="section-number-4">5.1.2.</span> org-agenda</h4>
<div class="outline-text-4" id="text-h:2b3b4eb6-68a1-476d-b5d1-940a21484f1d">
<p>
Here I setup a plethora of keywords, keybinds and paths to give my org-agenda more power.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(setq org-agenda-files '("/home/swarsel/Nextcloud/Org/Tasks.org"
                         "/home/swarsel/Nextcloud/Org/Archive.org"
                         "/home/swarsel/Nextcloud/Org/Anki.org"
                         "/home/swarsel/Calendars/leon_cal.org"))

(setq org-refile-targets
      '((swarsel-archive-org-file :maxlevel . 1)
        (swarsel-anki-org-file :maxlevel . 1)
        (swarsel-tasks-org-file :maxlevel . 1)))

(setq org-todo-keywords
      '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
        (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))


;; Configure custom agenda views
(setq org-agenda-custom-commands
      '(("d" "Dashboard"
         ((agenda "" ((org-deadline-warning-days 7)))
          (todo "NEXT"
                ((org-agenda-overriding-header "Next Tasks")))
          (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

        ("n" "Next Tasks"
         ((todo "NEXT"
                ((org-agenda-overriding-header "Next Tasks")))))

        ("W" "Work Tasks" tags-todo "+work-email")


        ("w" "Workflow Status"
         ((todo "WAIT"
                ((org-agenda-overriding-header "Waiting on External")
                 (org-agenda-files org-agenda-files)))
          (todo "REVIEW"
                ((org-agenda-overriding-header "In Review")
                 (org-agenda-files org-agenda-files)))
          (todo "PLAN"
                ((org-agenda-overriding-header "In Planning")
                 (org-agenda-todo-list-sublevels nil)
                 (org-agenda-files org-agenda-files)))
          (todo "BACKLOG"
                ((org-agenda-overriding-header "Project Backlog")
                 (org-agenda-todo-list-sublevels nil)
                 (org-agenda-files org-agenda-files)))
          (todo "READY"
                ((org-agenda-overriding-header "Ready for Work")
                 (org-agenda-files org-agenda-files)))
          (todo "ACTIVE"
                ((org-agenda-overriding-header "Active Projects")
                 (org-agenda-files org-agenda-files)))
          (todo "COMPLETED"
                ((org-agenda-overriding-header "Completed Projects")
                 (org-agenda-files org-agenda-files)))
          (todo "CANC"
                ((org-agenda-overriding-header "Cancelled Projects")
                 (org-agenda-files org-agenda-files)))))))


</pre>
</div>
</div>
</div>
<div id="outline-container-h:23183635-3d46-4d7d-8eda-e0a085b335ef" class="outline-4">
<h4 id="h:23183635-3d46-4d7d-8eda-e0a085b335ef"><span class="section-number-4">5.1.3.</span> org capture templates</h4>
<div class="outline-text-4" id="text-h:23183635-3d46-4d7d-8eda-e0a085b335ef">
<p>
I wrote these capture templates to allow myself to quickly create Anki cards from within Emacs. I nearly never use this feature, but it cannot hurt to have.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(setq org-capture-templates
      `(
        ("a" "Anki basic"
         entry
         (file+headline swarsel-org-anki-filepath "Dispatch")
         (function swarsel-anki-make-template-string))

        ("A" "Anki cloze"
         entry
         (file+headline org-swarsel-anki-file "Dispatch")
         "* %&lt;%H:%M&gt;\n:PROPERTIES:\n:ANKI_NOTE_TYPE: Cloze\n:ANKI_DECK: 🦁 All::01 ❤️ Various::00 ✨ Allgemein\n:END:\n** Text\n%?\n** Extra\n")
        ("t" "Tasks / Projects")
        ("tt" "Task" entry (file+olp swarsel-org-tasks-filepath "Inbox")
         "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)
        ))
)
</pre>
</div>
</div>
</div>
