Emacs.html

<div id="outline-container-h:40528f5a-c8cd-471b-b862-4088e8e61860" class="outline-4">
<h4 id="h:40528f5a-c8cd-471b-b862-4088e8e61860"><span class="section-number-4">5.1.4.</span> Font Faces</h4>
<div class="outline-text-4" id="text-h:40528f5a-c8cd-471b-b862-4088e8e61860">
<p>
Again, my understanding of the font-faces in Emacs is limited. This is mostly just tuned so that my org-files look acceptable.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">


;; Set faces for heading levels
(with-eval-after-load 'org-faces  (dolist (face '((org-level-1 . 1.1)
                                                  (org-level-2 . 0.9)
                                                  (org-level-3 . 0.9)
                                                  (org-level-4 . 0.9)
                                                  (org-level-5 . 0.9)
                                                  (org-level-6 . 0.9)
                                                  (org-level-7 . 0.9)
                                                  (org-level-8 . 0.9)))
                                    (set-face-attribute (car face) nil :font swarsel-alt-font :weight 'medium :height (cdr face)))

                      ;; Ensure that anything that should be fixed-pitch in Org files appears that way
                      (set-face-attribute 'org-block nil   :inherit 'fixed-pitch)
                      (set-face-attribute 'org-table nil   :inherit 'fixed-pitch)
                      (set-face-attribute 'org-formula nil   :inherit 'fixed-pitch)
                      (set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
                      (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
                      (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
                      (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
                      (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

</pre>
</div>
</div>
</div>

<div id="outline-container-h:62829574-a069-44b8-afb3-401a268d2747" class="outline-4">
<h4 id="h:62829574-a069-44b8-afb3-401a268d2747"><span class="section-number-4">5.1.5.</span> org-appear</h4>
<div class="outline-text-4" id="text-h:62829574-a069-44b8-afb3-401a268d2747">
<p>
This package makes emphasis-markers appear when the cursor moves over them. Very useful as I enjoy the clean look of not always seeing them, but it is annoying not to be able to edit them properly.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package org-appear
  :hook (org-mode . org-appear-mode)
  :init
  (setq org-appear-autolinks t)
  (setq org-appear-autokeywords t)
  (setq org-appear-autoentities t)
  (setq org-appear-autosubmarkers t))

</pre>
</div>
</div>
</div>

<div id="outline-container-h:bbcfa895-4d46-4b1d-b84e-f634e982c46e" class="outline-4">
<h4 id="h:bbcfa895-4d46-4b1d-b84e-f634e982c46e"><span class="section-number-4">5.1.6.</span> Centered org-mode Buffers</h4>
<div class="outline-text-4" id="text-h:bbcfa895-4d46-4b1d-b84e-f634e982c46e">
<p>
I like org-mode buffers to be centered, as I do not find that enormous lines are of big use.
</p>

<p>
Function definition in: <a href="#h:fa710375-2efe-49b4-af6a-a875aca6e4a2">Visual-fill column</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package visual-fill-column
  :hook (org-mode . swarsel/org-mode-visual-fill))

</pre>
</div>
</div>
</div>

<div id="outline-container-h:c1a0adea-ca97-43d7-b5a0-b856d2ebc9a8" class="outline-4">
<h4 id="h:c1a0adea-ca97-43d7-b5a0-b856d2ebc9a8"><span class="section-number-4">5.1.7.</span> Fix headings not folding sometimes</h4>
<div class="outline-text-4" id="text-h:c1a0adea-ca97-43d7-b5a0-b856d2ebc9a8">
<p>
There is a weird bug in org-mode that makes it so that headings were not folding correctly sometimes. This setting seems to fix it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(setq org-fold-core-style 'overlays)

</pre>
</div>
</div>
</div>

<div id="outline-container-h:3e0b6da3-0497-4080-bb49-bab949c03bc4" class="outline-4">
<h4 id="h:3e0b6da3-0497-4080-bb49-bab949c03bc4"><span class="section-number-4">5.1.8.</span> Babel</h4>
<div class="outline-text-4" id="text-h:3e0b6da3-0497-4080-bb49-bab949c03bc4">
<p>
org-babel allows to run blocks in other programming languages within an org-mode buffer, similar to what e.g. jupyterhub offers for python.
</p>

<p>
It also offers a very useful utility of exporting org-mode buffers to different formats; the feature I enjoy most is what makes this file useful: the tangling functionality.
</p>
</div>

<ol class="org-ol">
<li><a id="h:5d5ed7be-ec5f-4e17-bbb8-820ab6a9961c"></a>Language Configuration<br />
<div class="outline-text-5" id="text-h:5d5ed7be-ec5f-4e17-bbb8-820ab6a9961c">
<ul class="org-ul">
<li>This configures the languages that babel recognizes.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)
   (shell . t)
   ))

(push '("conf-unix" . conf-unix) org-src-lang-modes)

</pre>
</div>
</div>
</li>

<li><a id="h:d112ed66-b2dd-45cc-8d70-9cf6631f28a9"></a>old easy structure templates<br />
<div class="outline-text-5" id="text-h:d112ed66-b2dd-45cc-8d70-9cf6631f28a9">
<ul class="org-ul">
<li><p>
org 9.2 changed the way structure templates work. This brings back the old way it worked.
</p>

<p>
Usage: Type <code>&lt;</code>, followed by one of the below keywords and press <code>RET</code>. The corresponding source block should appear.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(require 'org-tempo)
(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python :results output"))
(add-to-list 'org-structure-template-alist '("nix" . "src nix :tangle"))

</pre>
</div></li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-h:4696e2fc-3296-47dc-8fc3-66912c329d4c" class="outline-4">
<h4 id="h:4696e2fc-3296-47dc-8fc3-66912c329d4c"><span class="section-number-4">5.1.9.</span> aucTex</h4>
<div class="outline-text-4" id="text-h:4696e2fc-3296-47dc-8fc3-66912c329d4c">
<p>
This provides several utilities for LaTeX in Emacs, including many completions and convenience functions for math-mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package auctex)
(setq TeX-auto-save t)
(setq TeX-save-query nil)
(setq TeX-parse-self t)
  (setq-default TeX-master nil)

(add-hook 'LaTeX-mode-hook 'visual-line-mode)
(add-hook 'LaTeX-mode-hook 'flyspell-mode)
(add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
(add-hook 'LaTeX-mode-hook 'reftex-mode)
(setq LaTeX-electric-left-right-brace t)
(setq font-latex-fontify-script nil)
(setq TeX-electric-sub-and-superscript t)
  ;; (setq reftex-plug-into-AUCTeX t)

</pre>
</div>
</div>
</div>
