programs/emacs/init.el

;; Set faces for heading levels
(with-eval-after-load 'org-faces  (dolist (face '((org-level-1 . 1.1)
                                                  (org-level-2 . 0.9)
                                                  (org-level-3 . 0.9)
                                                  (org-level-4 . 0.9)
                                                  (org-level-5 . 0.9)
                                                  (org-level-6 . 0.9)
                                                  (org-level-7 . 0.9)
                                                  (org-level-8 . 0.9)))
                                    (set-face-attribute (car face) nil :font swarsel-alt-font :weight 'medium :height (cdr face)))

                      ;; Ensure that anything that should be fixed-pitch in Org files appears that way
                      (set-face-attribute 'org-block nil   :inherit 'fixed-pitch)
                      (set-face-attribute 'org-table nil   :inherit 'fixed-pitch)
                      (set-face-attribute 'org-formula nil   :inherit 'fixed-pitch)
                      (set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
                      (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
                      (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
                      (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
                      (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

(use-package org-appear
  :hook (org-mode . org-appear-mode)
  :init
  (setq org-appear-autolinks t)
  (setq org-appear-autokeywords t)
  (setq org-appear-autoentities t)
  (setq org-appear-autosubmarkers t))

(use-package visual-fill-column
  :hook (org-mode . swarsel/org-mode-visual-fill))

(setq org-fold-core-style 'overlays)

(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)
   (js . t)
   (shell . t)
   ))

(push '("conf-unix" . conf-unix) org-src-lang-modes)

(require 'org-tempo)
(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python :results output"))
(add-to-list 'org-structure-template-alist '("nix" . "src nix :tangle"))

(use-package auctex)
(setq TeX-auto-save t)
(setq TeX-save-query nil)
(setq TeX-parse-self t)
  (setq-default TeX-master nil)

(add-hook 'LaTeX-mode-hook 'visual-line-mode)
(add-hook 'LaTeX-mode-hook 'flyspell-mode)
(add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
(add-hook 'LaTeX-mode-hook 'reftex-mode)
(setq LaTeX-electric-left-right-brace t)
(setq font-latex-fontify-script nil)
(setq TeX-electric-sub-and-superscript t)
  ;; (setq reftex-plug-into-AUCTeX t)
