Emacs.html

<div id="outline-container-h:406e5ecb-66f0-49bf-85ca-8b499f73ec5b" class="outline-4">
<h4 id="h:406e5ecb-66f0-49bf-85ca-8b499f73ec5b"><span class="section-number-4">5.1.10.</span> org-download</h4>
<div class="outline-text-4" id="text-h:406e5ecb-66f0-49bf-85ca-8b499f73ec5b">
<p>
This package allows to download and copy images into org-mode buffers. Sadly it does not work in a very stable manner - if you copy images that are also links to another page (like is often the case in a Google image search), Emacs might crash from this.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package org-download
  :after org
  :defer nil
  :custom
  (org-download-method 'directory)
  (org-download-image-dir "./images")
  (org-download-heading-lvl 0)
  (org-download-timestamp "org_%Y%m%d-%H%M%S_")
  ;;(org-image-actual-width 500)
  (org-download-screenshot-method "grim -g \"$(slurp)\" %s")
  :bind
  ("C-M-y" . org-download-screenshot)
  :config
  (require 'org-download))

</pre>
</div>
</div>
</div>

<div id="outline-container-h:a02b1162-3e19-46f1-8efc-9f375971645c" class="outline-4">
<h4 id="h:a02b1162-3e19-46f1-8efc-9f375971645c"><span class="section-number-4">5.1.11.</span> org-fragtog</h4>
<div class="outline-text-4" id="text-h:a02b1162-3e19-46f1-8efc-9f375971645c">
<p>
This package automatically toggles LaTeX-fragments in org-files. It seems to also work in markdown-files which is a nice addition, as my Obsidian notes are held in markdown.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package org-fragtog)
(add-hook 'org-mode-hook 'org-fragtog-mode)
(add-hook 'markdown-mode-hook 'org-fragtog-mode)

</pre>
</div>
</div>
</div>

<div id="outline-container-h:95b42e77-767c-4461-9ba8-b1c1cd18266c" class="outline-4">
<h4 id="h:95b42e77-767c-4461-9ba8-b1c1cd18266c"><span class="section-number-4">5.1.12.</span> org-modern</h4>
<div class="outline-text-4" id="text-h:95b42e77-767c-4461-9ba8-b1c1cd18266c">
<p>
This just makes org-mode a little bit more beautiful, mostly by making the <code>begin_src</code> and <code>end_src</code> tags in source-blocks turn into more beautiful icons, as well as hiding <code>#+</code> tags before them, as well as in the properties section of the file.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package org-modern
  :config (setq org-modern-block-name
                '((t . t)
                  ("src" "»" "∥")))
  :hook (org-mode . org-modern-mode))

</pre>
</div>
</div>
</div>
