Emacs.html

<div id="outline-container-h:4e11a845-a7bb-4eb5-b4ce-5b2f52e07425" class="outline-4">
<h4 id="h:4e11a845-a7bb-4eb5-b4ce-5b2f52e07425"><span class="section-number-4">5.1.13.</span> Presentations</h4>
<div class="outline-text-4" id="text-h:4e11a845-a7bb-4eb5-b4ce-5b2f52e07425">
<p>
Recently I have grown fond of holding presentations using Emacs :)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
    (use-package org-present
    :bind (:map org-present-mode-keymap
           ("q" . org-present-quit)
           ("&lt;left&gt;" . swarsel/org-present-prev)
           ("&lt;up&gt;" . 'ignore)
           ("&lt;down&gt;" . 'ignore)
           ("&lt;right&gt;" . swarsel/org-present-next))
    :hook ((org-present-mode . swarsel/org-present-start)
           (org-present-mode-quit . swarsel/org-present-end))
    )


    (use-package hide-mode-line)

    (defun swarsel/org-present-start ()
      (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)
                                         (header-line (:height 4.0) variable-pitch)
                                         (org-document-title (:height 1.75) org-document-title)
                                         (org-code (:height 1.55) org-code)
                                         (org-verbatim (:height 1.55) org-verbatim)
                                         (org-block (:height 1.25) org-block)
                                         (org-block-begin-line (:height 0.7) org-block)
                                         ))
      (dolist (face '((org-level-1 . 1.1)
                                                    (org-level-2 . 1.2)
                                                    (org-level-3 . 1.2)
                                                    (org-level-4 . 1.2)
                                                    (org-level-5 . 1.2)
                                                    (org-level-6 . 1.2)
                                                    (org-level-7 . 1.2)
                                                    (org-level-8 . 1.2)))
                                      (set-face-attribute (car face) nil :font swarsel-alt-font :weight 'medium :height (cdr face)))

      (setq header-line-format " ")
      (setq visual-fill-column-width 90)
      (setq indicate-buffer-boundaries nil)
      (setq inhibit-message nil)
      (breadcrumb-mode 0)
      (org-display-inline-images)
      (global-hl-line-mode 0)
      (display-line-numbers-mode 0)
      (org-modern-mode 0)
      (evil-insert-state 1)
      (beginning-of-buffer)
      (org-present-read-only)
      ;; (org-present-hide-cursor)
      (swarsel/org-present-slide)
      )

    (defun swarsel/org-present-end ()
           (setq-local face-remapping-alist '((default variable-pitch default)))
           (dolist (face '((org-level-1 . 1.1)
                                                    (org-level-2 . 0.9)
                                                    (org-level-3 . 0.9)
                                                    (org-level-4 . 0.9)
                                                    (org-level-5 . 0.9)
                                                    (org-level-6 . 0.9)
                                                    (org-level-7 . 0.9)
                                                    (org-level-8 . 0.9)))
                                      (set-face-attribute (car face) nil :font swarsel-alt-font :weight 'medium :height (cdr face)))
           (setq header-line-format nil)
           (setq visual-fill-column-width 150)
           (setq indicate-buffer-boundaries t)
           (setq inhibit-message nil)
           (breadcrumb-mode 1)
           (global-hl-line-mode 1)
           (display-line-numbers-mode 1)
           (org-remove-inline-images)
           (org-modern-mode 1)
           (evil-normal-state 1)
           ;; (org-present-show-cursor)
           )

  (defun swarsel/org-present-slide ()
    (org-overview)
    (org-show-entry)
    (org-show-children)
      )

  (defun swarsel/org-present-prev ()
    (interactive)
    (org-present-prev)
    (swarsel/org-present-slide))

  (defun swarsel/org-present-next ()
    (interactive)
    (unless (eobp)
    (org-next-visible-heading 1)
    (org-fold-show-entry))
    (when (eobp)
    (org-present-next)
    (swarsel/org-present-slide)
    ))

(defun clojure-leave-clojure-mode-function ()
 )

(add-hook 'buffer-list-update-hook #'clojure-leave-clojure-mode-function)
    (add-hook 'org-present-mode-hook 'swarsel/org-present-start)
    (add-hook 'org-present-mode-quit-hook 'swarsel/org-present-end)
    (add-hook 'org-present-after-navigate-functions 'swarsel/org-present-slide)

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-h:406c2ecc-0e3e-4d9f-9ae3-3eb1f8b87d1b" class="outline-3">
<h3 id="h:406c2ecc-0e3e-4d9f-9ae3-3eb1f8b87d1b"><span class="section-number-3">5.2.</span> Nix Mode</h3>
<div class="outline-text-3" id="text-h:406c2ecc-0e3e-4d9f-9ae3-3eb1f8b87d1b">
<p>
This adds a rudimentary nix-mode to Emacs. I have not really tried this out, as I am mostly editing nix-files in org-mode anyways.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package nix-mode
  :mode "\\.nix\\'")

</pre>
</div>
</div>
</div>
