Emacs.html

<div id="outline-container-h:50327461-a11b-4e81-830a-90febc720cfa" class="outline-3">
<h3 id="h:50327461-a11b-4e81-830a-90febc720cfa"><span class="section-number-3">5.3.</span> Markdown Mode</h3>
<div class="outline-text-3" id="text-h:50327461-a11b-4e81-830a-90febc720cfa">
</div>
<div id="outline-container-h:734dc40a-a2c4-4839-b884-cb99b81aa6fe" class="outline-4">
<h4 id="h:734dc40a-a2c4-4839-b884-cb99b81aa6fe"><span class="section-number-4">5.3.1.</span> Mode</h4>
<div class="outline-text-4" id="text-h:734dc40a-a2c4-4839-b884-cb99b81aa6fe">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(setq markdown-command "pandoc")

(use-package markdown-mode
  :ensure t
  :mode ("README\\.md\\'" . gfm-mode)
  :init (setq markdown-command "multimarkdown")
  :bind (:map markdown-mode-map
              ("C-c C-e" . markdown-do)))

</pre>
</div>
</div>
</div>

<div id="outline-container-h:8d90fe51-0b32-423a-a159-4f853bc29b68" class="outline-4">
<h4 id="h:8d90fe51-0b32-423a-a159-4f853bc29b68"><span class="section-number-4">5.3.2.</span> LaTeX in Markdown</h4>
<div class="outline-text-4" id="text-h:8d90fe51-0b32-423a-a159-4f853bc29b68">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(add-hook 'markdown-mode-hook
          (lambda ()
            (local-set-key (kbd "C-c C-x C-l") 'org-latex-preview)
            (local-set-key (kbd "C-c C-x C-u") 'markdown-toggle-url-hiding)
            ))

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-h:65e69741-9860-4ed0-bbed-7b7be9a2a9d6" class="outline-3">
<h3 id="h:65e69741-9860-4ed0-bbed-7b7be9a2a9d6"><span class="section-number-3">5.4.</span> Olivetti</h3>
<div class="outline-text-3" id="text-h:65e69741-9860-4ed0-bbed-7b7be9a2a9d6">
<p>
Olivetti is a mode specialized for writing prose in Emacs. I went for a very simple setup with little distractions.
</p>

<p>
This mode is not automatically activated anywhere because I only rarely need it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package olivetti
  :init
  (setq olivetti-body-width 100)
  (setq olivetti-recall-visual-line-mode-entry-state t))

</pre>
</div>
</div>
</div>

<div id="outline-container-h:94d4a0dc-b0d7-4702-b760-beeaa6da2b8f" class="outline-3">
<h3 id="h:94d4a0dc-b0d7-4702-b760-beeaa6da2b8f"><span class="section-number-3">5.5.</span> darkroom</h3>
<div class="outline-text-3" id="text-h:94d4a0dc-b0d7-4702-b760-beeaa6da2b8f">
<p>
Darkroom is package that reduces all forms of distraction to a minimum - this can be useful when simply reading a file for example. For this mode I have increased the text scale by a large margin to make for comfortable reading
This mode is not automatically activated anywhere because I only rarely need it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package darkroom
  :init
  (setq darkroom-text-scale-increase 3))

</pre>
</div>
</div>
</div>

<div id="outline-container-h:87453f1c-8ea5-4d0a-862d-8973d5bc5405" class="outline-3">
<h3 id="h:87453f1c-8ea5-4d0a-862d-8973d5bc5405"><span class="section-number-3">5.6.</span> Ripgrep</h3>
<div class="outline-text-3" id="text-h:87453f1c-8ea5-4d0a-862d-8973d5bc5405">
<p>
This is the ripgrep command for Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package rg)

</pre>
</div>
</div>
</div>
<div id="outline-container-h:543641d0-02a9-459e-a2d6-96c8fcc06864" class="outline-3">
<h3 id="h:543641d0-02a9-459e-a2d6-96c8fcc06864"><span class="section-number-3">5.7.</span> Tree-sitter</h3>
<div class="outline-text-3" id="text-h:543641d0-02a9-459e-a2d6-96c8fcc06864">
<p>
Tree-sitter is a parsing library integrated into Emacs to provide better syntax highlighting and code analysis. It generates concrete syntax trees for source code, enabling more accurate and efficient text processing. Emacs' tree-sitter integration enhances language support, offering features like incremental parsing and precise syntax-aware editing. This improves the development experience by providing robust and dynamic syntax features, making it easier for me to navigate and manipulate code.
</p>

<p>
In order to update the language grammars, run the next command below.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(mapc #'treesit-install-language-grammar (mapcar #'car treesit-language-source-alist))

</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package emacs
  :ensure nil
  :init
  (setq treesit-language-source-alist
        '((bash . ("https://github.com/tree-sitter/tree-sitter-bash"))
          (c . ("https://github.com/tree-sitter/tree-sitter-c"))
          (cmake . ("https://github.com/uyha/tree-sitter-cmake"))
          (cpp . ("https://github.com/tree-sitter/tree-sitter-cpp"))
          (css . ("https://github.com/tree-sitter/tree-sitter-css"))
          (elisp . ("https://github.com/Wilfred/tree-sitter-elisp"))
          (go . ("https://github.com/tree-sitter/tree-sitter-go"))
          (html . ("https://github.com/tree-sitter/tree-sitter-html"))
          (javascript . ("https://github.com/tree-sitter/tree-sitter-javascript"))
          (json . ("https://github.com/tree-sitter/tree-sitter-json"))
          (julia . ("https://github.com/tree-sitter/tree-sitter-julia"))
          (latex . ("https://github.com/latex-lsp/tree-sitter-latex"))
          (make . ("https://github.com/alemuller/tree-sitter-make"))
          (markdown . ("https://github.com/ikatyang/tree-sitter-markdown"))
          (R . ("https://github.com/r-lib/tree-sitter-r"))
          (python . ("https://github.com/tree-sitter/tree-sitter-python"))
          (typescript . ("https://github.com/tree-sitter/tree-sitter-typescript" "typescript/src" "typescript"))
          (rust . ("https://github.com/tree-sitter/tree-sitter-rust"))
          (sql . ("https://github.com/m-novikov/tree-sitter-sql"))
          (toml . ("https://github.com/tree-sitter/tree-sitter-toml"))
          (tsx  . ("https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src"))
          (yaml . ("https://github.com/ikatyang/tree-sitter-yaml"))))
  )

(use-package treesit-auto
  :config
  (global-treesit-auto-mode)
  (setq treesit-auto-install 'prompt))


</pre>
</div>
</div>
</div>

<div id="outline-container-h:82ddeef2-99f8-465b-ba36-07c3eaad717b" class="outline-3">
<h3 id="h:82ddeef2-99f8-465b-ba36-07c3eaad717b"><span class="section-number-3">5.8.</span> direnv</h3>
<div class="outline-text-3" id="text-h:82ddeef2-99f8-465b-ba36-07c3eaad717b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package direnv
  :custom (direnv-always-show-summary nil)
  :config (direnv-mode))

</pre>
</div>
</div>
</div>

<div id="outline-container-h:efb3f0fd-e846-4df9-ba48-2e45d776f68f" class="outline-3">
<h3 id="h:efb3f0fd-e846-4df9-ba48-2e45d776f68f"><span class="section-number-3">5.9.</span> avy</h3>
<div class="outline-text-3" id="text-h:efb3f0fd-e846-4df9-ba48-2e45d776f68f">
<p>
<code>avy</code> provides the ability to search for any character on the screen (not only in the current buffer!) - I enjoy this utility a lot and use it possibly even more often than the native vim commands.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package avy
  :bind
  (("M-o" . avy-goto-char-timer))
  :config
  (setq avy-all-windows 'all-frames))

</pre>
</div>
</div>
</div>
