Emacs.html

<div id="outline-container-h:1c1821c6-98de-4079-a4f3-6ba6e6dcb668" class="outline-3">
<h3 id="h:1c1821c6-98de-4079-a4f3-6ba6e6dcb668"><span class="section-number-3">5.10.</span> crdt (Collaborative Editing)</h3>
<div class="outline-text-3" id="text-h:1c1821c6-98de-4079-a4f3-6ba6e6dcb668">
<p>
With this it is possible to work on the same file collaboratively. I have never tried it out, but it sounds cool.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package crdt)

</pre>
</div>
</div>
</div>

<div id="outline-container-h:d9a6cb44-736e-4608-951f-e928e1b757c0" class="outline-3">
<h3 id="h:d9a6cb44-736e-4608-951f-e928e1b757c0"><span class="section-number-3">5.11.</span> devdocs</h3>
<div class="outline-text-3" id="text-h:d9a6cb44-736e-4608-951f-e928e1b757c0">
<p>
<code>devdocs</code> is a very nice package that provides documentation from <a href="https:devdocs.io">https:devdocs.io</a>. This is very useful since e.g. <code>pyright</code> provides only a very bad documentation and I do not want to leave Emacs all the time just to read documentation.
</p>

<p>
To install a documentation, use the <code>devdocs=install</code> command and select the appropriate version. <code>devdocs-update-all</code> can be used to download and reinstall all installed documents if a newer version is available. Check documentation with <code>devdocs-lookup</code> (<code>C-SPC h d</code>).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package devdocs)

(add-hook 'python-mode-hook
        (lambda () (setq-local devdocs-current-docs '("python~3.12" "numpy~1.23" "matplotlib~3.7" "pandas~1"))))
(add-hook 'python-ts-mode-hook
        (lambda () (setq-local devdocs-current-docs '("python~3.12" "numpy~1.23" "matplotlib~3.7" "pandas~1"))))

(add-hook 'c-mode-hook
        (lambda () (setq-local devdocs-current-docs '("c"))))
(add-hook 'c-ts-mode-hook
        (lambda () (setq-local devdocs-current-docs '("c"))))

(add-hook 'c++-mode-hook
        (lambda () (setq-local devdocs-current-docs '("cpp"))))
(add-hook 'c++-ts-mode-hook
        (lambda () (setq-local devdocs-current-docs '("cpp"))))

(devdocs-update-all)

</pre>
</div>
</div>
</div>

<div id="outline-container-h:5cde5032-251e-4cc4-9202-b4ce996f92c2" class="outline-3">
<h3 id="h:5cde5032-251e-4cc4-9202-b4ce996f92c2"><span class="section-number-3">5.12.</span> Projectile</h3>
<div class="outline-text-3" id="text-h:5cde5032-251e-4cc4-9202-b4ce996f92c2">
<p>
projectile is useful for keeping track of your git projects within Emacs. I mostly use it to quickly switch between projects.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'auto)) ;; integrate ivy into completion system
  :bind-keymap
  ("C-c p" . projectile-command-map) ; all projectile commands under this
  :init
  ;; NOTE: Set this to the folder where you keep your Git repos!
  (when (file-directory-p swarsel-projects-directory)
    (setq projectile-project-search-path (list swarsel-projects-directory)))
(setq projectile-switch-project-action #'magit-status))

</pre>
</div>
</div>
</div>

<div id="outline-container-h:d2c7323d-f8c6-4f23-b70a-930e3e4ecce5" class="outline-3">
<h3 id="h:d2c7323d-f8c6-4f23-b70a-930e3e4ecce5"><span class="section-number-3">5.13.</span> Magit</h3>
<div class="outline-text-3" id="text-h:d2c7323d-f8c6-4f23-b70a-930e3e4ecce5">
<p>
magit is the best git utility I have ever used - it has a beautiful interface and is very verbose. Here I mostly just setup the list of repositories that I want to expost to magit.
</p>

<p>
Also, Emacs needs a little extra love to accept my Yubikey for git commits etc. We also set that here.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package magit
  :config
  (setq magit-repository-directories `((,swarsel-projects-directory  . 1)
                                       (,swarsel-emacs-directory . 0)
                                       (,swarsel-obsidian-directory . 0)
                                       ("~/.dotfiles/" . 0)))
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)) ; stay in the same window

;; yubikey support for pushing commits
;; commiting is enabled through nixos gpg-agent config
(setq epg-pinentry-mode 'loopback)
(setenv "SSH_AUTH_SOCK" (string-chop-newline (shell-command-to-string "gpgconf --list-dirs agent-ssh-socket")))
</pre>
</div>
</div>
</div>

<div id="outline-container-h:1a8585ed-d9f2-478f-a132-440ada1cde2c" class="outline-3">
<h3 id="h:1a8585ed-d9f2-478f-a132-440ada1cde2c"><span class="section-number-3">5.14.</span> Forge</h3>
<div class="outline-text-3" id="text-h:1a8585ed-d9f2-478f-a132-440ada1cde2c">
<p>
NOTE: Make sure to configure a GitHub token before using this package!
</p>
<ul class="org-ul">
<li><a href="https://magit.vc/manual/forge/Token-Creation.html#Token-Creation">https://magit.vc/manual/forge/Token-Creation.html#Token-Creation</a></li>
<li><a href="https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started">https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started</a></li>
<li><a href="https://magit.vc/manual/ghub/Storing-a-Token.html">https://magit.vc/manual/ghub/Storing-a-Token.html</a></li>
<li><p>
<a href="https://www.emacswiki.org/emacs/GnuPG">https://www.emacswiki.org/emacs/GnuPG</a>
</p>

<p>
(1) in practice: github -&lt;&gt; settings -&lt;&gt; developer option -&lt;&gt;
    create classic token with repo; user; read:org permissions
(2) install GnuGP (and add to PATH)
(3) create ~/.authinfo.gpg with the following info scheme:
    machine api.github.com login USERNAME<sup>forge</sup> password 012345abcdef&#x2026;
</p></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package forge
  :after magit)

(with-eval-after-load 'forge
  (add-to-list 'forge-alist
               '("sgit.iue.tuwien.ac.at"
                 "sgit.iue.tuwien.ac.at/api/v1"
                 "sgit.iue.tuwien.ac.at"
                 forge-gitea-repository)))
</pre>
</div>
</div>
</div>

<div id="outline-container-h:cf5b0e6b-56a5-4a93-99fb-258eb7cb2eb4" class="outline-3">
<h3 id="h:cf5b0e6b-56a5-4a93-99fb-258eb7cb2eb4"><span class="section-number-3">5.15.</span> git-timemachine</h3>
<div class="outline-text-3" id="text-h:cf5b0e6b-56a5-4a93-99fb-258eb7cb2eb4">
<p>
This is just a nice utility to browse different versions of a file of a git project within Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package git-timemachine
   :hook (git-time-machine-mode . evil-normalize-keymaps)
   :init (setq git-timemachine-show-minibuffer-details t))

</pre>
</div>
</div>
</div>
