Emacs.org
** Delimiters (brackets): rainbow-delimiters, highlight-parentheses
:PROPERTIES:
:CUSTOM_ID: h:d9671ab7-a75a-47c6-a1f4-376d126c9b0a
:END:

- rainbow-delimiters colors all delimiters, also ones not in current selection
- paren highlights the current delimiter selection especially bold
- highlight-parentheses boldly highlights all delimiters in current selection

I am not completely sure on electric-pair-mode yet, sometimes it is very helpful, sometimes it annoys me to no end.

#+begin_src emacs-lisp

    (use-package rainbow-delimiters
      :hook (prog-mode . rainbow-delimiters-mode))

    (use-package highlight-parentheses
      :config
      (setq highlight-parentheses-colors '("black" "white" "black" "black" "black" "black" "black"))
      (setq highlight-parentheses-background-colors '("magenta" "blue" "cyan" "green" "yellow" "orange" "red"))
      (global-highlight-parentheses-mode t))

    (electric-pair-mode 1)
    (setq electric-pair-preserve-balance nil)
    ;; don't try to be overly smart
    (setq electric-pair-delete-adjacent-pairs nil)
    ;; don't skip newline when auto-pairing parenthesis
    (setq electric-pair-skip-whitespace-chars '(9 32))

    ;; in org-mode buffers, do not pair < and > in order not to interfere with org-tempo
  (add-hook 'org-mode-hook (lambda ()
             (setq-local electric-pair-inhibit-predicate
                     `(lambda (c)
                    (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))

#+end_src

** rainbow-mode
:PROPERTIES:
:CUSTOM_ID: h:d1a32a69-2f9a-45ef-95fe-a00e3551dc94
:END:

Complimentary to the delimiters-packages above, this package sets the background color of the delimiters, which makes it easier to see at a glance where we are in a delimiter-tree.

#+begin_src emacs-lisp

  (use-package rainbow-mode
    :config (rainbow-mode))

#+end_src
** Corfu
:PROPERTIES:
:CUSTOM_ID: h:5653d693-ecca-4c95-9633-66b9e3241070
:END:

This is the company equivalent to the vertico gang.
I dislike the standard behaviour that makes the cursor move into the completion framework on presses of =<up>= and =<down>=.

Nerd icons is originally enabled here: [[#h:eb0ea526-a83a-4664-b3a1-2b40d3a31493][Icons]]

Navigation functions defined here: [[#h:a1802f9b-bb71-4fd5-86fa-945da18e8b81][corfu: Do not interrupt navigation]]

#+begin_src emacs-lisp

      ;; (use-package corfu
      ;;   :custom
      ;;   (corfu-cycle t)
      ;;   :init
      ;;   (global-corfu-mode))

      (use-package corfu
        :init
        (global-corfu-mode)
        (corfu-history-mode)
        (corfu-popupinfo-mode) ; Popup completion info
        :custom
        (corfu-auto t)
        (corfu-auto-prefix 3)
        (corfu-auto-delay 0.3)
        (corfu-cycle t)
        (corfu-quit-no-match 'separator)
        (corfu-separator ?\s)
        ;; (corfu-quit-no-match t)
        (corfu-popupinfo-max-height 70)
        (corfu-popupinfo-delay '(0.5 . 0.2))
        ;; (corfu-preview-current 'insert) ; insert previewed candidate
        (corfu-preselect 'prompt)
        (corfu-on-exact-match nil)      ; Don't auto expand tempel snippets
        ;; Optionally use TAB for cycling, default is `corfu-complete'.
        :bind (:map corfu-map
                    ("M-SPC"      . corfu-insert-separator)
                    ("<return>" . swarsel/corfu-normal-return)
                    ;; ("C-<return>" . swarsel/corfu-complete)
                    ("S-<up>" . corfu-popupinfo-scroll-down)
                    ("S-<down>" . corfu-popupinfo-scroll-up)
                    ("C-<up>" . corfu-previous)
                    ("C-<down>" . corfu-next)
                    ("<insert-state> <up>"      . swarsel/corfu-quit-and-up)
                    ("<insert-state> <down>"     . swarsel/corfu-quit-and-down))
        )

      (use-package nerd-icons-corfu)

      (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter)

      (setq nerd-icons-corfu-mapping
            '((array :style "cod" :icon "symbol_array" :face font-lock-type-face)
              (boolean :style "cod" :icon "symbol_boolean" :face font-lock-builtin-face)
              ;; ...
              (t :style "cod" :icon "code" :face font-lock-warning-face)))

#+end_src

