Emacs.html

<div id="outline-container-h:d9671ab7-a75a-47c6-a1f4-376d126c9b0a" class="outline-3">
<h3 id="h:d9671ab7-a75a-47c6-a1f4-376d126c9b0a"><span class="section-number-3">5.16.</span> Delimiters (brackets): rainbow-delimiters, highlight-parentheses</h3>
<div class="outline-text-3" id="text-h:d9671ab7-a75a-47c6-a1f4-376d126c9b0a">
<ul class="org-ul">
<li>rainbow-delimiters colors all delimiters, also ones not in current selection</li>
<li>paren highlights the current delimiter selection especially bold</li>
<li>highlight-parentheses boldly highlights all delimiters in current selection</li>
</ul>

<p>
I am not completely sure on electric-pair-mode yet, sometimes it is very helpful, sometimes it annoys me to no end.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

  (use-package highlight-parentheses
    :config
    (setq highlight-parentheses-colors '("black" "white" "black" "black" "black" "black" "black"))
    (setq highlight-parentheses-background-colors '("magenta" "blue" "cyan" "green" "yellow" "orange" "red"))
    (global-highlight-parentheses-mode t))

  (electric-pair-mode 1)
  (setq electric-pair-preserve-balance nil)
  ;; don't try to be overly smart
  (setq electric-pair-delete-adjacent-pairs nil)
  ;; don't skip newline when auto-pairing parenthesis
  (setq electric-pair-skip-whitespace-chars '(9 32))

  ;; in org-mode buffers, do not pair &lt; and &gt; in order not to interfere with org-tempo
(add-hook 'org-mode-hook (lambda ()
           (setq-local electric-pair-inhibit-predicate
                   `(lambda (c)
                  (if (char-equal c ?&lt;) t (,electric-pair-inhibit-predicate c))))))

</pre>
</div>
</div>
</div>

<div id="outline-container-h:d1a32a69-2f9a-45ef-95fe-a00e3551dc94" class="outline-3">
<h3 id="h:d1a32a69-2f9a-45ef-95fe-a00e3551dc94"><span class="section-number-3">5.17.</span> rainbow-mode</h3>
<div class="outline-text-3" id="text-h:d1a32a69-2f9a-45ef-95fe-a00e3551dc94">
<p>
Complimentary to the delimiters-packages above, this package sets the background color of the delimiters, which makes it easier to see at a glance where we are in a delimiter-tree.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package rainbow-mode
  :config (rainbow-mode))

</pre>
</div>
</div>
</div>
<div id="outline-container-h:5653d693-ecca-4c95-9633-66b9e3241070" class="outline-3">
<h3 id="h:5653d693-ecca-4c95-9633-66b9e3241070"><span class="section-number-3">5.18.</span> Corfu</h3>
<div class="outline-text-3" id="text-h:5653d693-ecca-4c95-9633-66b9e3241070">
<p>
This is the company equivalent to the vertico gang.
I dislike the standard behaviour that makes the cursor move into the completion framework on presses of <code>&lt;up&gt;</code> and <code>&lt;down&gt;</code>.
</p>

<p>
Nerd icons is originally enabled here: <a href="#h:eb0ea526-a83a-4664-b3a1-2b40d3a31493">Icons</a>
</p>

<p>
Navigation functions defined here: <a href="#h:a1802f9b-bb71-4fd5-86fa-945da18e8b81">corfu: Do not interrupt navigation</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
;; (use-package corfu
;;   :custom
;;   (corfu-cycle t)
;;   :init
;;   (global-corfu-mode))

(use-package corfu
  :init
  (global-corfu-mode)
  (corfu-history-mode)
  (corfu-popupinfo-mode) ; Popup completion info
  :custom
  (corfu-auto t)
  (corfu-auto-prefix 3)
  (corfu-auto-delay 0.3)
  (corfu-cycle t)
  (corfu-quit-no-match 'separator)
  (corfu-separator ?\s)
  ;; (corfu-quit-no-match t)
  (corfu-popupinfo-max-height 70)
  (corfu-popupinfo-delay '(0.5 . 0.2))
  ;; (corfu-preview-current 'insert) ; insert previewed candidate
  (corfu-preselect 'prompt)
  (corfu-on-exact-match nil)      ; Don't auto expand tempel snippets
  ;; Optionally use TAB for cycling, default is `corfu-complete'.
  :bind (:map corfu-map
              ("M-SPC"      . corfu-insert-separator)
              ("&lt;return&gt;" . swarsel/corfu-normal-return)
              ;; ("C-&lt;return&gt;" . swarsel/corfu-complete)
              ("S-&lt;up&gt;" . corfu-popupinfo-scroll-down)
              ("S-&lt;down&gt;" . corfu-popupinfo-scroll-up)
              ("C-&lt;up&gt;" . corfu-previous)
              ("C-&lt;down&gt;" . corfu-next)
              ("&lt;insert-state&gt; &lt;up&gt;"      . swarsel/corfu-quit-and-up)
              ("&lt;insert-state&gt; &lt;down&gt;"     . swarsel/corfu-quit-and-down))
  )

(use-package nerd-icons-corfu)

(add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter)

(setq nerd-icons-corfu-mapping
      '((array :style "cod" :icon "symbol_array" :face font-lock-type-face)
        (boolean :style "cod" :icon "symbol_boolean" :face font-lock-builtin-face)
        ;; ...
        (t :style "cod" :icon "code" :face font-lock-warning-face)))

</pre>
</div>
</div>
</div>
