Emacs.html

<div id="outline-container-h:c3cc1c12-3ab8-42b7-be07-63f54eac397f" class="outline-3">
<h3 id="h:c3cc1c12-3ab8-42b7-be07-63f54eac397f"><span class="section-number-3">5.19.</span> cape</h3>
<div class="outline-text-3" id="text-h:c3cc1c12-3ab8-42b7-be07-63f54eac397f">
<p>
cape adds even more completion capabilities by adding a lot of completion logic that is exposed as separate functions. I tried out adding these to the <code>completion-at-points-functions</code> alist, but I felt like it cluttered my suggestions too much. Hence I now just call the respective functions when I need them. For this I setup the <code>C-z</code> keybinding in <a href="#h:218376e8-086b-46bf-91b3-78295d5d440f">General evil</a>.
</p>

<p>
I leave the commented out alist extensions here in case I want to try them out at some point in the future.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package cape
  :bind
  ("C-z p" . completion-at-point) ;; capf
  ("C-z t" . complete-tag)        ;; etags
  ("C-z d" . cape-dabbrev)        ;; or dabbrev-completion
  ("C-z h" . cape-history)
  ("C-z f" . cape-file)
  ("C-z k" . cape-keyword)
  ("C-z s" . cape-elisp-symbol)
  ("C-z e" . cape-elisp-block)
  ("C-z a" . cape-abbrev)
  ("C-z l" . cape-line)
  ("C-z w" . cape-dict)
  ("C-z :" . cape-emoji)
  ("C-z \\" . cape-tex)
  ("C-z _" . cape-tex)
  ("C-z ^" . cape-tex)
  ("C-z &amp;" . cape-sgml)
  ("C-z r" . cape-rfc1345)
  ;; Add to the global default value of `completion-at-point-functions' which is
  ;; used by `completion-at-point'.  The order of the functions matters, the
  ;; first function returning a result wins.  Note that the list of buffer-local
  ;; completion functions takes precedence over the global list.
  ;; (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  ;; (add-to-list 'completion-at-point-functions #'cape-file)
  ;; (add-to-list 'completion-at-point-functions #'cape-elisp-block)
  ;; (add-to-list 'completion-at-point-functions #'cape-history)
  ;; (add-to-list 'completion-at-point-functions #'cape-keyword)
  ;; (add-to-list 'completion-at-point-functions #'cape-tex)
  ;; (add-to-list 'completion-at-point-functions #'cape-sgml)
  ;; (add-to-list 'completion-at-point-functions #'cape-rfc1345)
  ;; (add-to-list 'completion-at-point-functions #'cape-abbrev)
  ;; (add-to-list 'completion-at-point-functions #'cape-dict)
  ;; (add-to-list 'completion-at-point-functions #'cape-elisp-symbol)
  ;; (add-to-list 'completion-at-point-functions #'cape-line)
)

</pre>
</div>
</div>
</div>

<div id="outline-container-h:3aa20438-edf6-4b13-a90d-3d5c51239c44" class="outline-3">
<h3 id="h:3aa20438-edf6-4b13-a90d-3d5c51239c44"><span class="section-number-3">5.20.</span> rust</h3>
<div class="outline-text-3" id="text-h:3aa20438-edf6-4b13-a90d-3d5c51239c44">
<p>
This is supposed to setup a rust-lsp - however, this has not worked nicely in the past and this configuration section is just a ruin really. I need to check what works and clean this up.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
  ;; (use-package rustic
  ;;   :ensure
  ;;   :bind (:map rustic-mode-map
  ;;               ("M-j" . lsp-ui-imenu)
  ;;               ("M-?" . lsp-find-references)
  ;;               ("C-c C-c l" . flycheck-list-errors)
  ;;               ("C-c C-c a" . lsp-execute-code-action)
  ;;               ("C-c C-c r" . lsp-rename)
  ;;               ("C-c C-c q" . lsp-workspace-restart)
  ;;               ("C-c C-c Q" . lsp-workspace-shutdown)
  ;;               ("C-c C-c s" . lsp-rust-analyzer-status))
  ;;   :config

  ;;   (setq rustic-format-on-save t)
  ;;   (add-hook 'rustic-mode-hook 'rk/rustic-mode-hook))

;;   (defun rk/rustic-mode-hook ()
;;     ;; so that run C-c C-c C-r works without having to confirm, but don't try to
;;     ;; save rust buffers that are not file visiting. Once
;;     ;; https://github.com/brotzeit/rustic/issues/253 has been resolved this should
;;     ;; no longer be necessary.
;;     (when buffer-file-name
;;       (setq-local buffer-save-without-query t))
;;     (add-hook 'before-save-hook 'lsp-format-buffer nil t))

;; (use-package rustic
;;   :config
;;   (setq rustic-format-on-save t)
;;   (setq rustic-lsp-client 'eglot)
;;   :custom
;;   (lsp-rust-analyzer-cargo-watch-command "clippy")
;;   (lsp-rust-analyzer-server-display-inlay-hints t)
;;   :mode ("\\.rs" . rustic-mode))

(use-package rustic
  :config
  (setq rustic-format-on-save t)
  (setq rustic-lsp-client 'eglot)
  :mode ("\\.rs" . rustic-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-h:b9b27a88-06f3-470b-a604-a20b2079bc26" class="outline-3">
<h3 id="h:b9b27a88-06f3-470b-a604-a20b2079bc26"><span class="section-number-3">5.21.</span> Tramp</h3>
<div class="outline-text-3" id="text-h:b9b27a88-06f3-470b-a604-a20b2079bc26">
<p>
Tramp allows for SSH access of files over Emacs. I have no ideas what the options here mean, but this is a recommended configuration that I found (sadly I lost the link). I need to research more what these options really do.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">


(use-package tramp
  :init
  (setq vc-ignore-dir-regexp
        (format "\\(%s\\)\\|\\(%s\\)"
                vc-ignore-dir-regexp
                tramp-file-name-regexp))
  (setq tramp-default-method "ssh")
  (setq tramp-auto-save-directory
        (expand-file-name "tramp-auto-save" user-emacs-directory))
  (setq tramp-persistency-file-name
        (expand-file-name "tramp-connection-history" user-emacs-directory))
  (setq password-cache-expiry nil)
  (setq tramp-use-ssh-controlmaster-options nil)
  (setq remote-file-name-inhibit-cache nil)
  :config
  (customize-set-variable 'tramp-ssh-controlmaster-options
                          (concat
                           "-o ControlPath=/tmp/ssh-tramp-%%r@%%h:%%p "
                           "-o ControlMaster=auto -o ControlPersist=yes"))
)



</pre>
</div>
</div>
</div>

<div id="outline-container-h:58415e95-8a7a-4517-acbb-5f1bb1028603" class="outline-3">
<h3 id="h:58415e95-8a7a-4517-acbb-5f1bb1028603"><span class="section-number-3">5.22.</span> diff-hl</h3>
<div class="outline-text-3" id="text-h:58415e95-8a7a-4517-acbb-5f1bb1028603">
<p>
This is a simple highlighting utility that uses the margin to visually show the differences since the last git commit.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package diff-hl
  :hook
  ((prog-mode
    org-mode) . diff-hl-mode)
  :init
  (diff-hl-flydiff-mode)
  (diff-hl-margin-mode)
  (diff-hl-show-hunk-mouse-mode))

</pre>
</div>
</div>
</div>
