Emacs.html
<div id="outline-container-h:d60ce0b1-cabf-43f5-a236-a1e4b400d2f5" class="outline-3">
<h3 id="h:d60ce0b1-cabf-43f5-a236-a1e4b400d2f5"><span class="section-number-3">5.23.</span> Commenting</h3>
<div class="outline-text-3" id="text-h:d60ce0b1-cabf-43f5-a236-a1e4b400d2f5">
<p>
This package allows for swift commenting out and in of code snippets. For some reason, it is a bit broken in my config, as it sometimes comments out too much, sometimes too little, and sometimes it splits lines during commenting. Also, in org-mode when inside a src-block, it often times jumps to the top of the block.
</p>

<p>
Still, this is avery convenient package.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))

</pre>
</div>
</div>
</div>

<div id="outline-container-h:9ec11ee4-2250-414a-87b5-73ee680a3a4a" class="outline-3">
<h3 id="h:9ec11ee4-2250-414a-87b5-73ee680a3a4a"><span class="section-number-3">5.24.</span> yasnippet</h3>
<div class="outline-text-3" id="text-h:9ec11ee4-2250-414a-87b5-73ee680a3a4a">
<p>
yasnippet allows to define snippets that can be quickly expanded by hitting the <code>TAB</code> key after inputting a keyword.
</p>

<p>
I used to run this together with the <code>yasnippet-snippets</code> package, but the snippets in there I did not find all too useful for myself. I need to create some custom snippets here one day.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package yasnippet
  :init (yas-global-mode 1)
  :config
  (yas-reload-all))

</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org910308c"></a>yasnippet math-snippets<br />
<div class="outline-text-5" id="text-5-24-0-1">
<p>
The following block is mostly inspired from <a href="https://code.kulupu.party/thesuess/WTFmacs/">https://code.kulupu.party/thesuess/WTFmacs/</a> and sets up a few prefixes that make LaTeX-math-mode nicer to use even with auctex and cape enabled.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">

(setq wtf/latex-mathbb-prefix "''")
(setq swarsel/latex-mathcal-prefix "``")

(use-package yasnippet
  :config

  (setq wtf/english-alphabet
        '("a" "b" "c" "d" "e" "f" "g" "h" "i" "j" "k" "l" "m" "n" "o" "p" "q" "r" "s" "t" "u" "v" "w" "x" "y" "z"))

  (dolist (elem wtf/english-alphabet)
    (when (string-equal elem (downcase elem))
      (add-to-list 'wtf/english-alphabet (upcase elem))))


  (yas-define-snippets
   'latex-mode
   (mapcar
    (lambda (elem)
      (list (concat wtf/latex-mathbb-prefix elem) (concat "\\mathbb{" elem "}") (concat "Mathbb letter " elem)))
    wtf/english-alphabet))

  (yas-define-snippets
   'latex-mode
   (mapcar
    (lambda (elem)
      (list (concat swarsel/latex-mathcal-prefix elem) (concat "\\mathcal{" elem "}") (concat "Mathcal letter " elem)))
    wtf/english-alphabet))

  (setq swtf/latex-math-symbols
        '(("x" . "\\times")
          ("*" . "\\cdot")
          ("." . "\\ldots")
          ("op" . "\\operatorname{$1}$0")
          ("o" . "\\circ")
          ("V" . "\\forall")
          ("v" . "\\vee")
          ("w" . "\\wedge")
          ("q" . "\\quad")
          ("f" . "\\frac{$1}{$2}$0")
          ("s" . "\\sum_{$1}^{$2}$0")
          ("p" . "\\prod_{$1}^{$2}$0")
          ("e" . "\\exists")
          ("i" . "\\int_{$1}^{$2}$0")
          ("c" . "\\cap")
          ("u" . "\\cup")
          ("0" . "\\emptyset")))

  )


</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org8a3df1c" class="outline-3">
<h3 id="org8a3df1c"><span class="section-number-3">5.25.</span> eglot</h3>
<div class="outline-text-3" id="text-5-25">
<p>
After having tried out <code>lsp-mode</code> and <code>lsp-bridge</code> for a while each, I must say that <code>eglot</code> feels the most clean and fast to me. Rust-modes need a little extra care to get working here.
</p>

<p>
:CUSTOM<sub>ID</sub>: h:424fbc62-84e2-42c7-a1ca-e43ea04c43e5
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package eglot
  :ensure nil
  :hook
  ((python-mode
    python-ts-mode
    c-mode
    c-ts-mode
    c++-mode
    c++-ts-mode
    tex-mode
    LaTeX-mode
    ) . (lambda () (progn
                     (eglot-ensure)
                     (add-hook 'before-save-hook 'eglot-format nil 'local))))
  :custom
  (eldoc-echo-area-use-multiline-p nil)
  (completion-category-defaults nil)
  :config
  ;; (push '(rustic-ts-mode . eglot-rust-analyzer) eglot-server-programs)
  (push '(rustic-mode . eglot-rust-analyzer) eglot-server-programs)
  (add-to-list 'eglot-server-programs '((rust-mode) . (eglot-rust-analyzer "rust-analyzer")))
  ;; (add-to-list 'eglot-server-programs '((python-mode) . ("pylsp")))
  ;; (add-to-list 'eglot-server-programs '((c-mode) . ("clangd")))
  :bind (:map eglot-mode-map
              ("M-(" . flymake-goto-next-error)
              ("C-c ," . eglot-code-actions)))

(defalias 'start-lsp-server #'eglot)

</pre>
</div>
</div>
</div>

<div id="outline-container-org0d359ae" class="outline-3">
<h3 id="org0d359ae"><span class="section-number-3">5.26.</span> Breadcrumb</h3>
<div class="outline-text-3" id="text-5-26">
<p>
This simple shows the path to the current file on the top of the buffer - I just think it looks kind of neat, even though it is not extremely useful :)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package breadcrumb
  :config (breadcrumb-mode))

</pre>
</div>
</div>
</div>

<div id="outline-container-h:e9a30d0f-423f-4e85-af4b-f8560f1c1b53" class="outline-3">
<h3 id="h:e9a30d0f-423f-4e85-af4b-f8560f1c1b53"><span class="section-number-3">5.27.</span> Prevent breaking of hardlinks</h3>
<div class="outline-text-3" id="text-h:e9a30d0f-423f-4e85-af4b-f8560f1c1b53">
<p>
This setting ensures that hard links are preserved during the backup process, which is useful for maintaining the integrity of files that are linked in multiple locations.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(setq backup-by-copying-when-linked t)

</pre>
</div>
</div>
</div>
