programs/emacs/init.el

(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))

(use-package yasnippet
  :init (yas-global-mode 1)
  :config
  (yas-reload-all))

(setq wtf/latex-mathbb-prefix "''")
(setq swarsel/latex-mathcal-prefix "``")

(use-package yasnippet
  :config

  (setq wtf/english-alphabet
        '("a" "b" "c" "d" "e" "f" "g" "h" "i" "j" "k" "l" "m" "n" "o" "p" "q" "r" "s" "t" "u" "v" "w" "x" "y" "z"))

  (dolist (elem wtf/english-alphabet)
    (when (string-equal elem (downcase elem))
      (add-to-list 'wtf/english-alphabet (upcase elem))))


  (yas-define-snippets
   'latex-mode
   (mapcar
    (lambda (elem)
      (list (concat wtf/latex-mathbb-prefix elem) (concat "\\mathbb{" elem "}") (concat "Mathbb letter " elem)))
    wtf/english-alphabet))

  (yas-define-snippets
   'latex-mode
   (mapcar
    (lambda (elem)
      (list (concat swarsel/latex-mathcal-prefix elem) (concat "\\mathcal{" elem "}") (concat "Mathcal letter " elem)))
    wtf/english-alphabet))

  (setq swtf/latex-math-symbols
        '(("x" . "\\times")
          ("*" . "\\cdot")
          ("." . "\\ldots")
          ("op" . "\\operatorname{$1}$0")
          ("o" . "\\circ")
          ("V" . "\\forall")
          ("v" . "\\vee")
          ("w" . "\\wedge")
          ("q" . "\\quad")
          ("f" . "\\frac{$1}{$2}$0")
          ("s" . "\\sum_{$1}^{$2}$0")
          ("p" . "\\prod_{$1}^{$2}$0")
          ("e" . "\\exists")
          ("i" . "\\int_{$1}^{$2}$0")
          ("c" . "\\cap")
          ("u" . "\\cup")
          ("0" . "\\emptyset")))

  )

(use-package eglot
  :ensure nil
  :hook
  ((python-mode
    python-ts-mode
    c-mode
    c-ts-mode
    c++-mode
    c++-ts-mode
    rustic-mode
    rust-ts-mode
    tex-mode
    LaTeX-mode
    ) . (lambda () (progn
                     (eglot-ensure)
                     (add-hook 'before-save-hook 'eglot-format nil 'local))))
  :custom
  (eldoc-echo-area-use-multiline-p nil)
  (completion-category-defaults nil)
  :bind (:map eglot-mode-map
              ("M-(" . flymake-goto-next-error)
              ("C-c ," . eglot-code-actions)))

(defalias 'start-lsp-server #'eglot)

(use-package breadcrumb
  :config (breadcrumb-mode))

(setq backup-by-copying-when-linked t)
