Emacs.html

<div id="outline-container-h:0918557a-8463-430c-b8df-6546dea9abd0" class="outline-3">
<h3 id="h:0918557a-8463-430c-b8df-6546dea9abd0"><span class="section-number-3">5.28.</span> Dirvish</h3>
<div class="outline-text-3" id="text-h:0918557a-8463-430c-b8df-6546dea9abd0">
<p>
Dirvish is an improvement upon the dired-framework and has more features like file preview etc. Sadly it has an incompatibility with <code>openwith</code> which is why I have disabled that package.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package dirvish
  :init
  (dirvish-override-dired-mode)
  :config
  (dirvish-peek-mode)
  (dirvish-side-follow-mode)
  (setq dirvish-open-with-programs
        (append dirvish-open-with-programs '(
                                             (("xlsx" "docx" "doc" "odt" "ods") "libreoffice" "%f")
                                             (("jpg" "jpeg" "png")              "imv" "%f")
                                             (("pdf")                           "sioyek" "%f")
                                             (("xopp")                          "xournalpp" "%f"))))
  :custom
  (delete-by-moving-to-trash t)
  (dired-listing-switches
   "-l --almost-all --human-readable --group-directories-first --no-group")
  (dirvish-attributes
   '(vc-state subtree-state nerd-icons collapse file-time file-size))
  (dirvish-quick-access-entries
   '(("h" "~/"              "Home")
     ("c" "~/.dotfiles/"    "Config")
     ("d" "~/Downloads/"    "Downloads")
     ("D" "~/Documents/"    "Documents")
     ("p" "~/Documents/GitHub/"  "Projects")
     ("/" "/"               "Root")))
  :bind
  (("&lt;DUMMY-i&gt; d" . 'dirvish)
   ("C-=" . 'dirvish-side)
   :map dirvish-mode-map
   ("h"   . dired-up-directory)
   ("&lt;left&gt;"   . dired-up-directory)
   ("l"   . dired-find-file)
   ("&lt;right&gt;"   . dired-find-file)
   ("j"   . evil-next-visual-line)
   ("k"   . evil-previous-visual-line)
   ("a"   . dirvish-quick-access)
   ("f"   . dirvish-file-info-menu)
   ("z"   . dirvish-history-last)
   ("J"   . dirvish-history-jump)
   ("y"   . dirvish-yank-menu)
   ("/"   . dirvish-narrow)
   ("TAB" . dirvish-subtree-toggle)
   ("M-f" . dirvish-history-go-forward)
   ("M-b" . dirvish-history-go-backward)
   ("M-l" . dirvish-ls-switches-menu)
   ("M-m" . dirvish-mark-menu)
   ("M-t" . dirvish-layout-toggle)
   ("M-s" . dirvish-setup-menu)
   ("M-e" . dirvish-emerge-menu)
   ("M-j" . dirvish-fd-jump)))

</pre>
</div>
</div>
</div>
<div id="outline-container-h:b108dd3e-f34d-4ed3-98df-0bf9de055889" class="outline-3">
<h3 id="h:b108dd3e-f34d-4ed3-98df-0bf9de055889"><span class="section-number-3">5.29.</span> pdf-tools: pdf-viewer and support for dirvish</h3>
<div class="outline-text-3" id="text-h:b108dd3e-f34d-4ed3-98df-0bf9de055889">
<p>
This enables pdf-previewing in dirvish and gives a much better pdf-viewer than is shipped normally by emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package pdf-tools
  :init
  (if (not (boundp 'pdf-tools-directory))
      (pdf-tools-install))
  :mode ("\\.pdf" . pdf-view-mode))

</pre>
</div>
</div>
</div>

<div id="outline-container-h:c15efae7-b884-4c97-8367-ccc7e7ed9ba8" class="outline-3">
<h3 id="h:c15efae7-b884-4c97-8367-ccc7e7ed9ba8"><span class="section-number-3">5.30.</span> Jupyter</h3>
<div class="outline-text-3" id="text-h:c15efae7-b884-4c97-8367-ccc7e7ed9ba8">
<p>
This is a jupyter client. Using it is a bit cumbersome though, so I have not fully explored all features.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package ein)

</pre>
</div>
</div>
</div>

<div id="outline-container-h:1fc538d1-8c53-48b2-8652-66046f4bbbf8" class="outline-3">
<h3 id="h:1fc538d1-8c53-48b2-8652-66046f4bbbf8"><span class="section-number-3">5.31.</span> undo-tree</h3>
<div class="outline-text-3" id="text-h:1fc538d1-8c53-48b2-8652-66046f4bbbf8">
<p>
Base emacs undo logic is very useful, but not easy to understand for me. I prefer undo-tree, which makes switching between branches easier and also allows quickly switching back to a much older state using the visualizer.
</p>

<p>
Evil needs to be told to use this mode, see <code>(evil-set-undo-system 'undo-tree)</code> in <a href="#h:218376e8-086b-46bf-91b3-78295d5d440f">Evil/General.</a>
</p>

<p>
By default, I am not using undo-tree-mode in every buffer. This might change in the future, but for now this is fine. It can be enabled manually should the need arise.
</p>

<p>
While we are at it, we are also setting up a persistent undo-file for every file that we are working with.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package undo-tree
  ;; :init (global-undo-tree-mode)
  :bind (:map undo-tree-visualizer-mode-map
              ("h" . undo-tree-visualize-switch-branch-left)
              ("l" . undo-tree-visualize-switch-branch-left)
              ("j" . undo-tree-visualize-redo)
              ("k" . undo-tree-visualize-undo))
  :config
  (setq undo-tree-history-directory-alist '(("." . "~/.emacs.d/undo"))))

(add-hook 'prog-mode-hook 'undo-tree-mode)
(add-hook 'text-mode-hook 'undo-tree-mode)
(add-hook 'org-mode-hook 'undo-tree-mode)
(add-hook 'latex-mode-hook 'undo-tree-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-h:b6c18dd0-3377-47ea-80c3-ac1486454e18" class="outline-3">
<h3 id="h:b6c18dd0-3377-47ea-80c3-ac1486454e18"><span class="section-number-3">5.32.</span> Hydra</h3>
<div class="outline-text-3" id="text-h:b6c18dd0-3377-47ea-80c3-ac1486454e18">
<p>
Hydra allows for the writing of macro-style functions. I have not yet looked into this all too much, but it seems to be a potent feature.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package hydra)

</pre>
</div>
</div>

<div id="outline-container-h:c5681884-7040-4b55-ab1b-5777631a0514" class="outline-4">
<h4 id="h:c5681884-7040-4b55-ab1b-5777631a0514"><span class="section-number-4">5.32.1.</span> Text scaling</h4>
<div class="outline-text-4" id="text-h:c5681884-7040-4b55-ab1b-5777631a0514">
<p>
I only wrote this in order to try out hydra; rarely do I really need this. However, it can be useful for <a href="#h:4e11a845-a7bb-4eb5-b4ce-5b2f52e07425">Presentations</a>. It simply scales the text size.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">

;; change the text size of the current buffer
(defhydra hydra-text-scale (:timeout 4)
  "scale text"
  ("j" text-scale-increase "in")
  ("k" text-scale-decrease "out")
  ("f" nil "finished" :exit t))

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-h:fff816a0-6d70-4bda-abab-833345e51100" class="outline-3">
<h3 id="h:fff816a0-6d70-4bda-abab-833345e51100"><span class="section-number-3">5.33.</span> External Applications</h3>
<div class="outline-text-3" id="text-h:fff816a0-6d70-4bda-abab-833345e51100">
</div>
