Emacs.html
<div id="outline-container-h:9335d32d-bf08-4601-820d-f3d1f33f876f" class="outline-4">
<h4 id="h:9335d32d-bf08-4601-820d-f3d1f33f876f"><span class="section-number-4">5.33.1.</span> Obsidian</h4>
<div class="outline-text-4" id="text-h:9335d32d-bf08-4601-820d-f3d1f33f876f">
<p>
This provides an interface to Obsidian for Emacs - as much as I want to like it, I actually enjoy using the official Obsidian app more - even though that cannot be used by Emacs directly.
</p>

<p>
My workflow for Obsidian is now as follows:
</p>

<ol class="org-ol">
<li>create notes either in Emacs or Obsidian</li>
<li><p>
look at them in the official client
</p>

<p>
I hope that this package will improve, then I will come back to it one day.
</p></li>
</ol>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
;; (use-package obsidian
;;   :ensure t
;;   :demand t
;;   :config
;;   (obsidian-specify-path swarsel-obsidian-vault-directory)
;;   (global-obsidian-mode t)
;;   :custom
;;   ;; This directory will be used for `obsidian-capture' if set.
;;   (obsidian-inbox-directory "Inbox")
;;   (bind-key (kbd "C-c M-o") 'obsidian-hydra/body 'obsidian-mode-map)
;;   :bind (:map obsidian-mode-map
;;               ;; Replace C-c C-o with Obsidian.el's implementation. It's ok to use another key binding.
;;               ("C-c C-o" . obsidian-follow-link-at-point)
;;               ;; Jump to backlinks
;;               ("C-c C-b" . obsidian-backlink-jump)
;;               ;; If you prefer you can use `obsidian-insert-link'
;;               ("C-c C-l" . obsidian-insert-wikilink)))

</pre>
</div>
</div>
</div>

<div id="outline-container-h:5854c9a6-1319-4961-a112-75b1bf2e1f69" class="outline-4">
<h4 id="h:5854c9a6-1319-4961-a112-75b1bf2e1f69"><span class="section-number-4">5.33.2.</span> Anki</h4>
<div class="outline-text-4" id="text-h:5854c9a6-1319-4961-a112-75b1bf2e1f69">
<p>
This section is here to make Anki usable from within Emacs - an endeavour that I have mostly given up on.
</p>
</div>

<ol class="org-ol">
<li><a id="h:d20559ed-7ada-4fea-a964-33bfd64b4549"></a>Basic Anki setup<br />
<div class="outline-text-5" id="text-h:d20559ed-7ada-4fea-a964-33bfd64b4549">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
;; (use-package anki-editor
;;   :after org
;;   :bind (:map org-mode-map
;;               ("&lt;f12&gt;" . anki-editor-cloze-region-auto-incr)
;;               ("&lt;f11&gt;" . anki-editor-cloze-region-dont-incr)
;;               ("&lt;f10&gt;" . anki-editor-reset-cloze-number)
;;               ("&lt;f9&gt;"  . anki-editor-push-tree))
;;   :hook (org-capture-after-finalize . anki-editor-reset-cloze-number) ; Reset cloze-number after each capture.
;;   :config
;;   (setq anki-editor-create-decks t ;; Allow anki-editor to create a new deck if it doesn't exist
;;         anki-editor-org-tags-as-anki-tags t)

;;   (defun anki-editor-cloze-region-auto-incr (&amp;optional arg)
;;     "Cloze region without hint and increase card number."
;;     (interactive)
;;     (anki-editor-cloze-region swarsel-anki-editor-cloze-number "")
;;     (setq swarsel-anki-editor-cloze-number (1+ swarsel-anki-editor-cloze-number))
;;     (forward-sexp))
;;   (defun anki-editor-cloze-region-dont-incr (&amp;optional arg)
;;     "Cloze region without hint using the previous card number."
;;     (interactive)
;;     (anki-editor-cloze-region (1- swarsel-anki-editor-cloze-number) "")
;;     (forward-sexp))
;;   (defun anki-editor-reset-cloze-number (&amp;optional arg)
;;     "Reset cloze number to ARG or 1"
;;     (interactive)
;;     (setq swarsel-anki-editor-cloze-number (or arg 1)))
;;   (defun anki-editor-push-tree ()
;;     "Push all notes under a tree."
;;     (interactive)
;;     (anki-editor-push-notes '(4))
;;     (anki-editor-reset-cloze-number))
;;   ;; Initialize
;;   (anki-editor-reset-cloze-number)
;;   )

;; (require 'anki-editor)

</pre>
</div>
</div>
</li>

<li><a id="h:64242e95-6454-4330-bcb9-15353083bade"></a>Own Anki functions<br />
<div class="outline-text-5" id="text-h:64242e95-6454-4330-bcb9-15353083bade">
<ul class="org-ul">
<li>These functions enable you to quickly set the destination note type and deck</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
;; (defvar swarsel-anki-deck nil)
;; (defvar swarsel-anki-notetype nil)
;; (defvar swarsel-anki-fields nil)

;; (defun swarsel-anki-set-deck-and-notetype ()
;;   (interactive)
;;   (setq swarsel-anki-deck  (completing-read "Choose a deck: "
;;                                             (sort (anki-editor-deck-names) #'string-lessp)))
;;   (setq swarsel-anki-notetype (completing-read "Choose a note type: "
;;                                                (sort (anki-editor-note-types) #'string-lessp)))
;;   (setq swarsel-anki-fields (progn
;;                               (anki-editor--anki-connect-invoke-result "modelFieldNames" `((modelName . ,swarsel-anki-notetype)))))
;;   )

;; (defun swarsel-anki-make-template-string ()
;;   (if (not swarsel-anki-deck)
;;       (call-interactively 'swarsel-anki-set-deck-and-notetype))
;;   (setq swarsel-temp swarsel-anki-fields)
;;   (concat (concat "* %&lt;%H:%M&gt;\n:PROPERTIES:\n:ANKI_NOTE_TYPE: " swarsel-anki-notetype "\n:ANKI_DECK: " swarsel-anki-deck "\n:END:\n** ")(pop swarsel-temp) "\n%?\n** " (mapconcat 'identity swarsel-temp "\n\n** ") "\n\n"))

;; (defun swarsel-today()
;;   (format-time-string "%Y-%m-%d"))

;; (defun swarsel-obsidian-daily ()
;;   (interactive)
;;   (if (not (file-exists-p (expand-file-name (concat (swarsel-today) ".md") swarsel-obsidian-daily-directory)))
;;       (write-region "" nil (expand-file-name (concat (swarsel-today) ".md") swarsel-obsidian-daily-directory))
;;     )
;;   (find-file (expand-file-name (concat (swarsel-today) ".md") swarsel-obsidian-daily-directory)))

</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
