Emacs.html

<div id="outline-container-h:2f333330-b19d-4f64-85ea-146ff28667e8" class="outline-3">
<h3 id="h:2f333330-b19d-4f64-85ea-146ff28667e8"><span class="section-number-3">5.34.</span> Email + Calendar</h3>
<div class="outline-text-3" id="text-h:2f333330-b19d-4f64-85ea-146ff28667e8">
</div>
<div id="outline-container-h:48fde614-7cd0-4764-a7ac-0dae60d8b65a" class="outline-4">
<h4 id="h:48fde614-7cd0-4764-a7ac-0dae60d8b65a"><span class="section-number-4">5.34.1.</span> make sure mu4e is found</h4>
<div class="outline-text-4" id="text-h:48fde614-7cd0-4764-a7ac-0dae60d8b65a">
<p>
This seems not to be needed - I do not yet dare to delete it though.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
;; (let ((mu4epath
;;        (concat
;;         (f-dirname
;;          (file-truename
;;           (executable-find "mu")))
;;         "/../share/emacs/site-lisp/mu4e")))
;;   (when (and
;;          (string-prefix-p "/nix/store/" mu4epath)
;;          (file-directory-p mu4epath))
;;     (add-to-list 'load-path mu4epath)))

</pre>
</div>
</div>
</div>

<div id="outline-container-h:b92a18cf-eec3-4605-a8c2-37133ade3574" class="outline-4">
<h4 id="h:b92a18cf-eec3-4605-a8c2-37133ade3574"><span class="section-number-4">5.34.2.</span> mu4e</h4>
<div class="outline-text-4" id="text-h:b92a18cf-eec3-4605-a8c2-37133ade3574">
<p>
In this section we are setting up mu4e, a mail client for emacs using mu with mbsync as backend. The mail accounts themselves are setup in the NixOS configuration, so we only need to add Emacs specific settings here.
</p>

<p>
The hook functions are defined here: <a href="#h:34506761-06b9-43b5-a818-506d9b3faf28">mu4e functions</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package mu4e
  :ensure nil
  ;; :load-path "/usr/share/emacs/site-lisp/mu4e/"
  ;;:defer 20 ; Wait until 20 seconds after startup
  :config

  ;; This is set to 't' to avoid mail syncing issues when using mbsync
  (setq send-mail-function 'sendmail-send-it)
  (setq mu4e-change-filenames-when-moving t)
  (setq mu4e-mu-binary (executable-find "mu"))
  (setq mu4e-hide-index-messages t)

  (setq mu4e-update-interval 180)
  (setq mu4e-get-mail-command "mbsync -a")
  (setq mu4e-maildir "~/Mail")

  ;; enable inline images
  (setq mu4e-view-show-images t)
  ;; use imagemagick, if available
  (when (fboundp 'imagemagick-register-types)
    (imagemagick-register-types))

  (setq mu4e-drafts-folder "/Drafts")
  (setq mu4e-sent-folder   "/Sent Mail")
  (setq mu4e-refile-folder "/All Mail")
  (setq mu4e-trash-folder  "/Trash")

  (setq mu4e-maildir-shortcuts
        '((:maildir "/leon/Inbox"    :key ?1)
          (:maildir "/nautilus/Inbox" :key ?2)
          (:maildir "/mrswarsel/Inbox"     :key ?3)
          (:maildir "/Sent Mail"     :key ?s)
          (:maildir "/Trash"     :key ?t)
          (:maildir "/Drafts"     :key ?d)
          (:maildir "/All Mail"     :key ?a)))

(setq user-mail-address "leon@swarsel.win"
      user-full-name "Leon Schwarzäugl")


(setq mu4e-user-mail-address-list '(leon.schwarzaeugl@gmail.com leon@swarsel.win nautilus.dw@gmail.com mrswarsel@gmail.com)))


(add-hook 'mu4e-compose-mode-hook #'swarsel/mu4e-send-from-correct-address)
(add-hook 'mu4e-compose-post-hook #'swarsel/mu4e-restore-default)
</pre>
</div>
</div>
</div>

<div id="outline-container-h:43209eeb-5d46-472e-b7c2-58a3fb465199" class="outline-4">
<h4 id="h:43209eeb-5d46-472e-b7c2-58a3fb465199"><span class="section-number-4">5.34.3.</span> mu4e-alert</h4>
<div class="outline-text-4" id="text-h:43209eeb-5d46-472e-b7c2-58a3fb465199">
<p>
This adds the simple utility of sending desktop notifications whenever a new mail is received. I am using <code>libnotify</code> because I want to use this with <code>notify-send</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package mu4e-alert
:config
(setq mu4e-alert-set-default-style 'libnotify))

(add-hook 'after-init-hook #'mu4e-alert-enable-notifications)

(mu4e t)
</pre>
</div>
</div>
</div>

<div id="outline-container-h:c760f04e-622f-4b3e-8916-53ca8cce6edc" class="outline-4">
<h4 id="h:c760f04e-622f-4b3e-8916-53ca8cce6edc"><span class="section-number-4">5.34.4.</span> Calendar</h4>
<div class="outline-text-4" id="text-h:c760f04e-622f-4b3e-8916-53ca8cce6edc">
<p>
This provides a beautiful calender to emacs.
</p>

<p>
Yes, I am aware that I am exposing my university-calendar to the public here. I can imagine worse things ;) if you however know how to obscure this, let me know!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package org-caldav
  :init
  ;; set org-caldav-sync-initalization
  (setq swarsel-caldav-synced 0)
  (setq org-caldav-url "https://stash.swarsel.win/remote.php/dav/calendars/Swarsele")
  (setq org-caldav-calendars
        '((:calendar-id "personal"
                        :inbox "~/Calendars/leon_cal.org")))
  ;; (setq org-caldav-backup-file "~/org-caldav/org-caldav-backup.org")
  ;; (setq org-caldav-save-directory "~/org-caldav/")

  :config
  (setq org-icalendar-alarm-time 1)
  ;; This makes sure to-do items as a category can show up on the calendar
  (setq org-icalendar-include-todo t)
  ;; This ensures all org "deadlines" show up, and show up as due dates
  (setq org-icalendar-use-deadline '(event-if-todo event-if-not-todo todo-due))
  ;; This ensures "scheduled" org items show up, and show up as start times
  (setq org-icalendar-use-scheduled '(todo-start event-if-todo event-if-not-todo))
  )

(use-package calfw
  :ensure nil
  :bind ("C-c A" . swarsel/open-calendar)
  :init
  (use-package calfw-cal
    :ensure nil)
  (use-package calfw-org
    :ensure nil)
  (use-package calfw-ical
    :ensure nil)
  :config
  (bind-key "g" 'cfw:refresh-calendar-buffer cfw:calendar-mode-map)
  (bind-key "q" 'evil-quit cfw:details-mode-map)
  ;; (custom-set-faces
  ;;  '(cfw:face-title ((t (:foreground "#f0dfaf" :weight bold :height 65))))
  ;; )
  )

(defun swarsel/open-calendar ()
  (interactive)
  (unless (eq swarsel-caldav-synced 1) (org-caldav-sync) (setq swarsel-caldav-synced 1))
  ;;  (select-frame (make-frame '((name . "calendar")))) ; makes a new frame and selects it
  ;; (set-face-attribute 'default (selected-frame) :height 65) ; reduces the font size of the new frame
  (cfw:open-calendar-buffer
   :contents-sources
   (list
    (cfw:org-create-source "Purple")  ; orgmode source
    (cfw:ical-create-source "TISS" "https://tiss.tuwien.ac.at/events/rest/calendar/personal?locale=de&amp;token=4463bf7a-87a3-490a-b54c-99b4a65192f3" "Cyan"))))

</pre>
</div>
</div>
</div>
</div>
