Emacs.html

<div id="outline-container-h:48f5be2b-b3d2-4276-bd49-2630733f23d5" class="outline-3">
<h3 id="h:48f5be2b-b3d2-4276-bd49-2630733f23d5"><span class="section-number-3">5.35.</span> Dashboard: emacs startup screen</h3>
<div class="outline-text-3" id="text-h:48f5be2b-b3d2-4276-bd49-2630733f23d5">
<p>
This sets up the <code>dashboard</code>, which is really quite useless. But, it looks cool and makes me happy whenever I start an emacsclient without a file name as argument :)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook)
  ;; (setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
  (setq dashboard-display-icons-p t ;; display icons on both GUI and terminal
        dashboard-icon-type 'nerd-icons ;; use `nerd-icons' package
        dashboard-set-file-icons t
        dashboard-items '((recents . 5)
                          (projects . 5)
                          (agenda . 5))
        dashboard-set-footer nil
        dashboard-banner-logo-title "Welcome to SwarsEmacs!"
        dashboard-image-banner-max-height 300
        dashboard-startup-banner "~/.dotfiles/wallpaper/swarsel.png"
        dashboard-projects-backend 'projectile
        dashboard-projects-switch-function 'magit-status
        dashboard-set-navigator t
        dashboard-startupify-list '(dashboard-insert-banner
                                    dashboard-insert-newline
                                    dashboard-insert-banner-title
                                    dashboard-insert-newline
                                    dashboard-insert-navigator
                                    dashboard-insert-newline
                                    dashboard-insert-init-info
                                    dashboard-insert-items
                                    )
        dashboard-navigator-buttons
        `(;; line1
          ((,""
            "SwarselSocial"
            "Browse Swarsele"
            (lambda (&amp;rest _) (browse-url "instagram.com/Swarsele")))

           (,""
            "SwarselSound"
            "Browse SwarselSound"
            (lambda (&amp;rest _) (browse-url "sound.swarsel.win")) )
           (,""
            "SwarselSwarsel"
            "Browse Swarsel"
            (lambda (&amp;rest _) (browse-url "github.com/Swarsel")) )
           (,""
            "SwarselStash"
            "Browse SwarselStash"
            (lambda (&amp;rest _) (browse-url "stash.swarsel.win")) )
           (,"󰫑"
            "SwarselSport"
            "Browse SwarselSports"
            (lambda (&amp;rest _) (browse-url "social.parkour.wien/@Lenno")))
           )
          (
           (,"󱄅"
            "swarsel.win"
            "Browse swarsel.win"
            (lambda (&amp;rest _) (browse-url "swarsel.win")))
           )
          )))


</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Leon Schwarzäugl</p>
<p class="date">Created: 2024-06-20 Do 01:55</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
