programs/emacs/init.el

(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook)
  ;; (setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
  (setq dashboard-display-icons-p t ;; display icons on both GUI and terminal
        dashboard-icon-type 'nerd-icons ;; use `nerd-icons' package
        dashboard-set-file-icons t
        dashboard-items '((recents . 5)
                          (projects . 5)
                          (agenda . 5))
        dashboard-set-footer nil
        dashboard-banner-logo-title "Welcome to SwarsEmacs!"
        dashboard-image-banner-max-height 300
        dashboard-startup-banner "~/.dotfiles/wallpaper/swarsel.png"
        dashboard-projects-backend 'projectile
        dashboard-projects-switch-function 'magit-status
        dashboard-set-navigator t
        dashboard-startupify-list '(dashboard-insert-banner
                                    dashboard-insert-newline
                                    dashboard-insert-banner-title
                                    dashboard-insert-newline
                                    dashboard-insert-navigator
                                    dashboard-insert-newline
                                    dashboard-insert-init-info
                                    dashboard-insert-items
                                    )
        dashboard-navigator-buttons
        `(;; line1
          ((,""
            "SwarselSocial"
            "Browse Swarsele"
            (lambda (&rest _) (browse-url "instagram.com/Swarsele")))

           (,""
            "SwarselSound"
            "Browse SwarselSound"
            (lambda (&rest _) (browse-url "sound.swarsel.win")) )
           (,""
            "SwarselSwarsel"
            "Browse Swarsel"
            (lambda (&rest _) (browse-url "github.com/Swarsel")) )
           (,""
            "SwarselStash"
            "Browse SwarselStash"
            (lambda (&rest _) (browse-url "stash.swarsel.win")) )
           (,"󰫑"
            "SwarselSport"
            "Browse SwarselSports"
            (lambda (&rest _) (browse-url "social.parkour.wien/@Lenno")))
           )
          (
           (,"󱄅"
            "swarsel.win"
            "Browse swarsel.win"
            (lambda (&rest _) (browse-url "swarsel.win")))
           )
          )))
